[
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000000",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 1,
    "text": "Owner’s Manual BWC EXCEL 15 Wind Turbine & Powersync III Grid-Intertie Inverter Rev. 0 August 2018 Bergey Windpower Co. 2200 Industrial Blvd. Norman, OK 73069 USA TEL: 405-364-4212 FAX: 405-364-2078 E-mail: sales@bergey.com Web Site:www.bergey.com Owner’s Manual Bergey EXCEL 15 Turbine Page 2 Contents I. INTRODUCTION ...................................................................................................... 4 II. EXCEL 15 SPECIFICATIONS ................................................................................. 5 III. SYSTEM DESCRIPTION ...................................................................................... 6 A. SPINNER ........................................................................................................... 7 B. ROTOR SYSTEM .............................................................................................. 7 C. ALTERNATOR ................................................................................................... 7 D. MAINFRAME ...................................................................................................... 7 E. BACK-UP BRAKING .......................................................................................... 7 F. TAIL ASSEMBLY ............................................................................................... 8 G. SLIP-RING ASSEMBLY ..................................................................................... 8 H. YAW BEARING ASSEMBLY .............................................................................. 8 I. POWERSYNC III INVERTER ................................................................................ 8 IV. SYSTEM OPERATION .......................................................................................... 9 A. NORMAL OPERATION ...................................................................................... 9 B. HIGH WINDS ................................................................................................... 10 C. PROBLEMS WITH POWER GRID ................................................................... 10 D. EMERGENCY SHUTDOWN ............................................................................ 10 E. BACK-UP BRAKING SYSTEM ........................................................................ 11 V. POWERSYNC III INVERTER................................................................................. 12 A. INVERTER SPECIFICATIONS ........................................................................ 13 B. Other Specifications ......................................................................................... 13 C. Important Inverter Safety Instructions .............................................................. 14 D. Installation ........................................................................................................ 15 1. Dimensions ................................................................................................... 15 2. Locating ........................................................................................................ 15 3. Mounting ....................................................................................................... 16 4. Electrical Connections .................................................................................. 16 5. AC Output Connection .................................................................................. 17 6. AC Input Connection (Turbine) ..................................................................... 17 7. Earth Ground Connection ............................................................................. 17 8. Fuse replacement ......................................................................................... 18 Owner’s Manual Bergey EXCEL 15 Turbine Page 3 9. Connection example ..................................................................................... 18 E. Inverter Operation ............................................................................................ 19 F. Touch Screen Display ...................................................................................... 19 G. Inverter Fault Codes ......................................................................................... 22 VI. TURBINE INSTALLATION .................................................................................. 24 A. BWC EXCEL WIND TURBINE and TOWER .................................................... 24 B. FUSED DISCONNECT SWITCH ..................................................................... 25 C. WIRE RUN AND WIRE SIZES ......................................................................... 25 D. POWERSYNC III INVERTER ........................................................................... 25 VII. INSPECTIONS AND MAINTENANCE................................................................. 27 VIII. Trouble-Shooting Problems ................................................................................. 29 IX. Appendix ............................................................................................................. 32 Owner’s Manual Bergey EXCEL 15 Turbine Page 4 I. INTRODUCTION This manual contains important information concerning your Bergey EXCEL 15 wind turbine system and its operational characteristics. We strongly recommend that you read and familiarize yourself with its contents. At several points in this manual items of special interest or significant impact are highlighted by one of the following indicators: DANGER: Hazards or unsafe practices that could cause personal injury or death. WARNING: Hazards or unsafe practices which could cause product damage. NOTE Significant points of interest. Serial Numbers Each Bergey EXCEL 15 wind turbine has a serial number located on the tower adapter. The turbine serial number can also be found on the outside of the shipping crate and on the warranty registration card. The blade serial numbers are located on the root pad and also the shipping crate. We recommend that the serial number be copied to this manual for possible future reference. Bergey EXCEL 15 Serial No.: ________________________ Bergey EXCEL 15 Blades Serial Numbers: ________________________ The Powersync III inverter has a serial number label on its right side. We recommend that this serial number also be copied to this manual. Powersync III Serial No.: __________________________ Owner’s Manual Bergey EXCEL 15 Turbine Page 5 II. EXCEL 15 SPECIFICATIONS PERFORMANCE START-UP WIND SPEED 9 mph (4 m/s) CUT-IN WIND SPEED 6 mph (2.5 m/s) RATED WIND SPEED 24.6 mph (11 m/s) AWEA RATED POWER (at 11 m/s or 25 mph) 15.6 kW AWEA ANNUAL ENERGY (at 5 m/s average 29,800 kWh CUT-OUT WIND SPEED none MAXIMUM DESIGN WIND SPEED 134 mph (60m/s) MAXIMUM POWER 22.6 kW ROTOR SPEED 0-150 RPM MECHANICAL TYPE 3-Blade Upwind, Horizontal-Axis ROTOR DIAMETER 31.5 ft. (9.2 m) WEIGHT 1,400 lb. (636 kg) GEARBOX none BLADE PITCH CONTROL none OVERSPEED PROTECTION Blade stall TEMPERATURE RANGE -40 to 140 deg. F (-40 to 60 deg. C) ELECTRICAL OUTPUT FORM 240VAC, 1-Phase, 60Hz GENERATOR Permanent Magnet Alternator POWER"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000001",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 5,
    "text": "mph) 15.6 kW AWEA ANNUAL ENERGY (at 5 m/s average 29,800 kWh CUT-OUT WIND SPEED none MAXIMUM DESIGN WIND SPEED 134 mph (60m/s) MAXIMUM POWER 22.6 kW ROTOR SPEED 0-150 RPM MECHANICAL TYPE 3-Blade Upwind, Horizontal-Axis ROTOR DIAMETER 31.5 ft. (9.2 m) WEIGHT 1,400 lb. (636 kg) GEARBOX none BLADE PITCH CONTROL none OVERSPEED PROTECTION Blade stall TEMPERATURE RANGE -40 to 140 deg. F (-40 to 60 deg. C) ELECTRICAL OUTPUT FORM 240VAC, 1-Phase, 60Hz GENERATOR Permanent Magnet Alternator POWER PROCESSOR Powersync III Inverter Wind Speed (m/s) at Hub Height 1 m/s = 2.237 mph Power Output (AC kW) Owner’s Manual Bergey EXCEL 15 Turbine Page 6 III. SYSTEM DESCRIPTION The Bergey EXCEL 15 is an upwind horizontal-axis wind turbine designed for distributed generation applications, connected to the power grid on the customer’s side of the utility meter. The complete unit consists of the following major components, as shown in the figure below: 1. Spinner 6. Tail Assembly 2. PowerFlex® Rotor Blades 7. Slip-Rings 3. Alternator 8. Yaw Bearing Assembly 4. Mainframe 9. Powersync® III Inverter 5. Back-up Braking 10. Auxiliary Load (not shown) Spinner PowerFlex® Rotor Blades Alternator Back-up BrakingMainframe T ail Assembly Slip-Rings Powersync® III Inverter Yaw Bearing Assembly Owner’s Manual Bergey EXCEL 15 Turbine Page 7 A. SPINNER The spinner (nose cone) is purely cosmetic. B. ROTOR SYSTEM The rotor system consists of three high-technology carbon-fiber PowerFlex® blades. Acting like aircraft wings, the blades convert the energy of the wind into rotational forces that drive the alternator. The PowerFlex® blades are rigidly attached to the alternator and they are fixed pitch. The Excel 15 rotor blades have proprietary airfoils, which were custom designed to provide high efficiency and low noise. Each blade has a serial number inscribed on its root pad at the inboard end. C. ALTERNATOR The alternator converts the rotational energy of the rotor into electricity. The alternator utilizes permanent magnets and has an inverted configuration in that the outside housing rotates, while the internal windings are stationary. It was specifically designed for the Bergey EXCEL 15 and produces power at low speeds, eliminating the need for a speed-increasing gearbox. Since it uses permanent magnets, the alternator is generating voltage whenever the rotor is turning. DANGER The output wiring of the EXCEL 15 presents a shock hazard whenever the rotor is turning. Caution must be exercised at all times to avoid electrical shock. D. MAINFRAME The mainframe is the structural backbone of the wind turbine. It serves as the attachment point for the rotor/alternator assembly, the tail assembly, the yaw bearing assembly. It also houses the yaw-axis slip-ring assembly and the controls for the back- up braking system. E. BACK-UP BRAKING The back-up braking system is an added safety system that prevents rotor overspeed in the event of a failure of the primary speed control system (inverter and dump load). Owner’s Manual Bergey EXCEL 15 Turbine Page 8 F. TAIL ASSEMBLY The tail assembly keeps the rotor aligned into the wind. G. SLIP-RING ASSEMBLY The slip-rings and brushes conduct the electricity generated in the alternator from the moving (as it orients with the direction) wind turbine to the fixed tower wiring. The slip- rings are enclosed in the steel mainframe housing to help protect them from the weather and lightning. H. YAW BEARING ASSEMBLY The yaw bearing assembly allows the turbine to freely align itself to the wind direction. I. POWERSYNC III INVERTER The Powersync III inverter converts the “variable AC” from the Bergey EXCEL 15 turbine into utility grade electricity so that it can be connected to the wiring in your home or business."
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000002",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 8,
    "text": "turbine to the fixed tower wiring. The slip- rings are enclosed in the steel mainframe housing to help protect them from the weather and lightning. H. YAW BEARING ASSEMBLY The yaw bearing assembly allows the turbine to freely align itself to the wind direction. I. POWERSYNC III INVERTER The Powersync III inverter converts the “variable AC” from the Bergey EXCEL 15 turbine into utility grade electricity so that it can be connected to the wiring in your home or business. This conversion requires sophisticated electronics and is designed to operate automatically. The Powersync III has a digital display that provides information on the status of the system, its current output power, and its cumulative energy production. The system also includes an auxiliary load bank that absorbs excess wind energy during strong wind gusts. Owner’s Manual Bergey EXCEL 15 Turbine Page 9 IV. SYSTEM OPERATION A. NORMAL OPERATION The Bergey EXCEL 15 produces utility compatible power in the form of 240VAC, 60 Hz, single phase electricity (other voltage options are available). It is connected through the Powersync® III inverter to the utility distribution network in the same manner as household appliances or electrical machinery. When the wind speed is too low to operate the wind turbine, all of the electrical power needed for the home or business will be supplied by the utility company. During these idle periods the Powersync® III will consume approximately 0.3 kilowatt-hours of electricity per day. When the system begins producing power, the amount of power which must be purchased from the utility is reduced by an amount equal to the output of the wind system. From the perspective of the utility company the wind system output reduces the electrical load they have to supply, just as if you turned off lights and appliances. The output of the wind system fluctuates with the speed of the wind so the instantaneous amount of electricity being saved will be constantly changing. Quite often your home will be served simultaneously by the utility and your Bergey wind turbine. When the output of the wind system exceeds the power requirements of the house the excess electricity is sent back to the utility. Both the consumer’s right to interconnect a wind system and the utilities obligation to purchase excess power are prescribed by federal law (PURPA, Section 210). The amount you will be credited or paid for this excess production varies state-to-state and sometimes utility-to-utility. If your utility company offers “net metering” then your meter is allowed to turn backwards so that you essentially bank energy, at full value, for less windy periods. This banking can be done over a month or over a year depending on the policy of your state or your utility. If you do not get “net metering” then you will have a second utility meter to register excess production and your utility will pay or credit you for this, typically at less than the rate you pay when you purchase their electricity. If your utility experiences an outage (blackout) the wind system will cease to produce power so that it does not present an electrical safety hazard to utility repair crews. During a power outage the Excel 15 turbine will come to a stop. When utility power is restored, the Powersync III will automatically return the wind system to full working status following a five minute delay and then a two minute countdown. These time delays are dictated in the UL standards required by the utilities. The rotor of the EXCEL 15 should begin to rotate when the wind speed reaches approximately 9 mph (4 m/s). Once"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000003",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 9,
    "text": "to utility repair crews. During a power outage the Excel 15 turbine will come to a stop. When utility power is restored, the Powersync III will automatically return the wind system to full working status following a five minute delay and then a two minute countdown. These time delays are dictated in the UL standards required by the utilities. The rotor of the EXCEL 15 should begin to rotate when the wind speed reaches approximately 9 mph (4 m/s). Once started, the rotor may continue to turn in winds below 5 mph (2.2 m/s), but the system will not be producing power below this wind speed. Owner’s Manual Bergey EXCEL 15 Turbine Page 10 NOTE All operational wind speeds given assume steady winds, sea-level conditions and moderate temperatures. Hot weather, high altitude, turbulence and gusting winds will reduce system performance. NOTE The Excel 15 may exhibit poor start-up performance in light steady winds. The design of the blades is optimized for efficiency and storm protection, which necessitated some sacrifice in start-up characteristics. The rotor speed will increase with increasing wind speed and the system will produce a higher output. This output increases rapidly because the energy available in the wind varies as the third power (cube) of the wind speed. For example, if the wind speed increased form 5 mph to 10 mph, a factor of two, the energy in the wind would increase from one unit to eight units, a factor of eight (2 to the 3rd power). One result of this relationship is that there is very little energy available in light winds. For the average site, winds in the range of 12-20 mph (5.5 – 9 m/s) will provide most of the system’s energy production on an annual basis. The Excel 15 will operate at variable speed up to about 20 mph (9 m/s) and about 150 RPM. The speed of the rotor is controlled to limit at about 150 RPM. B. HIGH WINDS Unlike previous Bergey wind turbines, the Excel 15 does not furl (rotor turned away from the wind). The Excel 15 controls speed and protects itself from high winds by stalling the rotor progressively as wind speeds increase. In sustained high winds the rotor speed is reduced to limit power surges during strong gusts. C. PROBLEMS WITH POWER GRID If an abnormal condition occurs on the utility line, such as a voltage fluctuation or a complete interruption, the Powersync III inverter will automatically disconnect the wind turbine from the power grid and bring the rotor to a stop. D. EMERGENCY SHUTDOWN The Bergey EXCEL 15 is designed for unattended operation over an extended period of time. Exceptional situations may occur, however, in which the wind turbine should be shutdown. These situations include: 1. EXCESSIVE VIBRATION - Uneven ice build-up, ice shedding, or blade damage may cause the wind turbine to experience excessive vibration. Always shut the turbine down as soon as an increase in vibration is detected. Any new or excessive vibration in the turbine when ice is not present should be investigated immediately. 2. UNUSUAL SOUND - If the turbine begins making clinking, growling, or other unusual sound it Owner’s Manual Bergey EXCEL 15 Turbine Page 11 should be shut down and fully inspected as soon as possible. 3. INSPECTION AND MAINTENANCE - Whenever someone must climb the tower the wind turbine must be shut down. Shut down of the EXCEL 15 is accomplished by operating (pressing) the red Emergency Stop button on the Powersync III inverter. To release the Emergency Stop, turn the red button clockwise until it snaps outward. This will"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000004",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 10,
    "text": "growling, or other unusual sound it Owner’s Manual Bergey EXCEL 15 Turbine Page 11 should be shut down and fully inspected as soon as possible. 3. INSPECTION AND MAINTENANCE - Whenever someone must climb the tower the wind turbine must be shut down. Shut down of the EXCEL 15 is accomplished by operating (pressing) the red Emergency Stop button on the Powersync III inverter. To release the Emergency Stop, turn the red button clockwise until it snaps outward. This will resume automatic operation of the wind turbine. WARNING: Do not open the disconnect switch on the tower during shutdown. This would allow the turbine to restart and if the turbine tried to overspeed it would trigger the back-up braking system. E. BACK-UP BRAKING SYSTEM If the primary overspeed protection system fails, the Excel 15 has a back-up braking system located on the wind turbine. It detects an overspeed situation and applies a dynamic brake to bring the rotor to a near stop. You can tell this has occurred if the Powersync III display says “Waiting for wind” and there’s plenty of wind [greater than 15 mph (6.7 m/s)], but the rotor does not turn. It will automatically reset if the wind drops below 2 m/s (4.5 mph). Otherwise, you can manually restart the turbine by activating and then restoring the Emergency Stop button on the Powersync III inverter. If activation of the Back-up Brake occurs repeatedly we strongly recommend that you contact your dealer or the Service Department at BWC. Owner’s Manual Bergey EXCEL 15 Turbine Page 12 V. POWERSYNC III INVERTER The Powersync III inverter is connected to the household or building electrical circuits through a dedicated circuit breaker. Before opening the Powersync III enclosure, the breaker must be turned off and the turbine Emergency Stop must be activated, to avoid electrical shock. DANGER Electric Shock Hazard. Failure to comply will result in death or serious injury. Disconnect all power to the inverter before servicing. Wait at least 5 minutes before opening the inverter door. Using the utility grid as a reference, the Powersync III inverter converts the output of the wind turbine into utility-compatible power (AC). The Powersync III inverter has been designed for automatic, unattended operation and it is programmed to provide maximum performance from your Bergey EXCEL 15 wind turbine. It is also programmed to safely disconnect the wind turbine in the event of a problem with the utility power and to automatically reconnect the turbine after the problem is remedied. The LCD digital display on the front of the Powersync III provides information on the status of your Bergey EXCEL 15 wind turbine. The contrast can be adjusted UP or DOWN using hidden buttons on the right side of the display. In normal operation the Powersync III will show the status as “Running” and will display the instantaneous Output Power in Watts. Owner’s Manual Bergey EXCEL 15 Turbine Page 13 A. INVERTER SPECIFICATIONS Input – From Turbine Input Voltage Maximum (3 Phase Input) 480 VAC Input Start Voltage Minimum 270 VAC Input Operating Voltage Range 270 to 480 VAC Input Frequency Maximum 47 Hz Input Current Maximum 34 Amps Output – To Utility Model PSIII-240 PSIII-208 Continuous Output Power Maximum 22600 W 18800 W Continuous Output Power Tolerance ±10% Output Voltage Nominal (Single Phase) Line-Line 240 VAC 208 VAC Operating Voltage Range Line-Line 212-264 184-228 Output Voltage Nominal (Single Phase) Line-Neutral 120 VAC Operating Voltage Range Line-Neutral 106-132 VAC Continuous Output Current Maximum 90 Amps Continuous Output Current Tolerance ± 10% Voltage Measurement Tolerance ± 10 VAC Operating Frequency Nominal 60 Hz Operating Frequency Range"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000005",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 13,
    "text": "Current Maximum 34 Amps Output – To Utility Model PSIII-240 PSIII-208 Continuous Output Power Maximum 22600 W 18800 W Continuous Output Power Tolerance ±10% Output Voltage Nominal (Single Phase) Line-Line 240 VAC 208 VAC Operating Voltage Range Line-Line 212-264 184-228 Output Voltage Nominal (Single Phase) Line-Neutral 120 VAC Operating Voltage Range Line-Neutral 106-132 VAC Continuous Output Current Maximum 90 Amps Continuous Output Current Tolerance ± 10% Voltage Measurement Tolerance ± 10 VAC Operating Frequency Nominal 60 Hz Operating Frequency Range 59.3 to 60.5 Hz Operating Frequency Measurement Tolerance ± 0.5 Hz Output Power Factor 0.95 ± 0.05 Temperature Range Normal Operation -4°F to 113ºF (-20ºC to 45ºC) Output Over-Current Protection Maximum 100 Amps Synchronization In-Rush Current Maximum 6.3 Amps Utility Interconnection Trip Time 100 msec Time Measurement Tolerance ± 85 msec B. Other Specifications Dimensions 32.2”H x 24.3”W x 9” D 817 x 607 x 230 mm Weight 153 lbs. / 64 Kg Enclosure NEMA Type 1 NEMA 1 indicates that the enclosure is constructed for indoor use only. It provides protection to personnel against incidental contact with the enclosed equipment. Owner’s Manual Bergey EXCEL 15 Turbine Page 14 C. Important Inverter Safety Instructions SAVE THESE INSTRUCTIONS This manual contains important instructions for Models PSIII-240 and PSIII-208 that shall be followed during installation and maintenance of the inverter. The output field wiring terminal can be used for connection of a maximum of: One 1/0 AWG wire per terminal (1 wire for each line) The input field wiring terminal can be used for connection of a maximum of: One 2 AWG wire per terminal (1 wire per phase per terminal provided). The field-wiring terminals shall be connected using the following wire types: Copper Conductors Only (Input connection) Use No. 8 - 2 AWG, 90 °C copper wire only Copper, Aluminum or Copper-Clad Aluminum Conductors Only (Output connection) Use No. 6 – 1/0 AWG, 90 °C Copper Conductors Use No. 4 – 1/0 AWG, 90 °C Copper Clad Aluminum, or Aluminum Conductors. The following symbols are used as markings on this product with the following meanings: Equipment grounding conductor – This inverter is intended for operation in an indoor NEMA 1 compatible environment having a maximum ambient temperature of 45° C (113° F). This unit or system is provided with fixed trip limits and shall not be aggregated above 30 kW on a single Point of Common Connection CAUTION To reduce the risk of fire, connect only to a circuit provided with 100 amperes maximum branch-circuit over-current protection in accordance with the National Electrical Code, ANSI/NFPA 70. Hot surfaces – To reduce the risk of burns – Do not touch The enclosure and the rear heatsink can exceed 70° C (150° F). Note that the input and output circuits are isolated from the enclosure. In accordance with Clause 15.2.1.1 of CAN/CSA-C22.2 No. 107.1, system grounding, when required by the Canadian Electrical Code, Part I, is the responsibility of the installer. Owner’s Manual Bergey EXCEL 15 Turbine Page 15 D. Installation 1. Dimensions 2. Locating • The inverter must be installed in a weather protected environment. • The inverter emits audible noise when operating. Do not locate the inverter in living spaces or on walls directly connected to living spaces. • For maximum energy production, avoid installing in direct sunlight or in locations that are likely to exceed 45ºC (113ºF) local ambient temperature. Owner’s Manual Bergey EXCEL 15 Turbine Page 16 • The inverter will automatically shut down if the temperature is below -20ºC (-4ºF). Protect from extreme cold exposure if this is undesirable. • Enclosure ventilation is to be provided such that"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000006",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 15,
    "text": "operating. Do not locate the inverter in living spaces or on walls directly connected to living spaces. • For maximum energy production, avoid installing in direct sunlight or in locations that are likely to exceed 45ºC (113ºF) local ambient temperature. Owner’s Manual Bergey EXCEL 15 Turbine Page 16 • The inverter will automatically shut down if the temperature is below -20ºC (-4ºF). Protect from extreme cold exposure if this is undesirable. • Enclosure ventilation is to be provided such that the following guidelines are satisfied. o Provide a minimum of 12 inches clearance to the bottom air inlet filters. o Provide a minimum of 6 inches clearance to the outlet side vents. o Use in a well-ventilated area within the maximum ambient temperature rating. • If the inverter is installed in a small structure or out building, the structure must be provided with top and bottom venting of at least 100 square inches at each opening. 3. Mounting • The enclosure, having a NEMA 1 rating, is designed for indoor installation. • The enclosure is provided with four mounting feet with 0.281” dia. mounting holes. • For mounting to a 0.10” thick metal surface, use M6, ¼-20 or ¼-28 bolts grade 3 or higher with nuts and flat washers. • For mounting to concrete, use M6 or ¼” bolts using concrete anchors with an 800 pound or greater tension rating. • The required bolt length is such that the internal threads need to be 100% engaged. • The enclosure is to be oriented with the conduit openings facing toward the floor. 4. Electrical Connections • Connections are made to the unit via the holes in the bottom of the enclosure. • Holes are sized for 1.5’’ rated conduit. Wiring methods in accordance with the National Electrical Code, ANSI/NFPA 70 are to be used. • It is recommended that at least 12” of flexible conduit be used below the inverter to make alignment easier. • Cutting additional holes in the enclosure is not recommended and voids the warranty on the enclosure against corrosion and water damage. Any damage to the electronics caused by the modification will be your responsibility. Owner’s Manual Bergey EXCEL 15 Turbine Page 17 5. AC Output Connection • The AC output is single phase and not bonded to ground. • Connect the two single phase 240VAC or 208VAC wires from the distribution panel to the dual fuse block located on the lower left side of the enclosure. • Tightening torque, allowable wire size, and type, for the Field-Wiring Terminals: • 6 AWG to a maximum of 1/0 AWG for Copper Conductors Only • 4 AWG to a maximum of 1/0 AWG for Aluminum Or Copper- Clad Aluminum Conductors Only • Wire rated 90°C minimum • 100 lbf-in tightening torque maximum 6. AC Input Connection (Turbine) • Connect the three phase turbine wires to the terminal block located on the lower right side of the enclosure. • The inverter’s wind turbine input must be connected to a 3-phase “delta” or “wye” connection with the neutral not connected to earth ground (left floating). • The inverter must be provided with 3, UL listed fuses rated, 400 VAC minimum, 50 Amp maximum for proper protection from the wind turbine input to the unit as well as an appropriate UL listed fuse holder to accommodate the fuses. • Tightening torque, allowable wire size, and type, for the Field-Wiring Terminals: • 50 lbf-in tightening torque • 8 AWG - to a maximum of 2 AWG for Copper Conductors Only • Wire rated 90°C minimum. 7. Earth Ground Connection • Earth ground is"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000007",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 17,
    "text": "with 3, UL listed fuses rated, 400 VAC minimum, 50 Amp maximum for proper protection from the wind turbine input to the unit as well as an appropriate UL listed fuse holder to accommodate the fuses. • Tightening torque, allowable wire size, and type, for the Field-Wiring Terminals: • 50 lbf-in tightening torque • 8 AWG - to a maximum of 2 AWG for Copper Conductors Only • Wire rated 90°C minimum. 7. Earth Ground Connection • Earth ground is to be connected to the two terminals provided inside the enclosure indicated by the earth ground equipment marking. • Allowable wire size range is 8 AWG – 4 AWG. • 50 lbf-in tightening torque • The inverter’s earth ground connections available on both the input and output terminals must be bonded directly to the service entrance’s earth ground which in turn is bonded to neutral. With a second bond, the inverter’s earth ground Owner’s Manual Bergey EXCEL 15 Turbine Page 18 connection must be bonded directly to the tower disconnect ground lug which in turn is bonded to the tower’s ground rod. • The input and output circuits are isolated from the enclosure. System grounding when required by the Canadian Electrical Code, Part I, is the responsibility of the installer. 8. Fuse replacement • Warning: For continued protection against risk of fire, replace only with same type and ratings of fuse. • Two output fuses are located in the dual fuse block on the lower left side of the enclosure. • Class T 80A, 300VAC • Two pre-charge fuses are located on the Input/Output PCB board. • Class CC Time Delay, 2.5A, 600VAC • Three input fuses are located in a separate fuse box provided by the installer. Fuse type may vary, but must be UL listed fuses rated, 400 VAC minimum, 50 Amp maximum 9. Connection example As typically the tallest structure in the area, lightning damage is a concern to most inverter customers; especially those customers in areas with frequent cloud to ground lighting. BWC’s warranty does not cover lightning damage to the inverter. A direct lightning strike can easily be in excess of 100kV at 100kA. Proper grounding of the turbine to the tower and running the input wires down the tower in grounded metal Owner’s Manual Bergey EXCEL 15 Turbine Page 19 conduit will take care of most of this energy. The standard inverter is capable of withstanding input line to ground surges of about 6kV at 3kA. Contact your distributor or BWC for application specific lightning surge suppression solutions. E. Inverter Operation This equipment is a UL 1741 certified1 Utility Interactive Inverter and complies with the requirements of IEEE1547 which is the standard for interconnecting distributed resources with electric power systems. It will not operate in an off-grid or backup power configuration. The normal operation of the inverter is as follows: When single phase utility power is applied to the output of the inverter, the display will power up and a message stating that the unit is initializing is shown. If there are no faults, i.e. grid voltage and frequency are in tolerance, a countdown timer set for 5 minutes (300 seconds) starts before the inverter is ready to transfer power to the utility grid. The inverter will automatically transfer power to the utility when AC voltages in the range of 30VAC to 600VAC are present at the Turbine input. As the heatsink heats up after exporting significant power for a period of time the internal cooling fans will activate. The inverter is be able to operate at full power continuously if provided with adequate"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000008",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 19,
    "text": "timer set for 5 minutes (300 seconds) starts before the inverter is ready to transfer power to the utility grid. The inverter will automatically transfer power to the utility when AC voltages in the range of 30VAC to 600VAC are present at the Turbine input. As the heatsink heats up after exporting significant power for a period of time the internal cooling fans will activate. The inverter is be able to operate at full power continuously if provided with adequate ventilation and the local ambient temperature stays below 45ºC (113ºF). If the ventilation is compromised or the heatsink temperature exceeds 60°C, the inverter will automatically reduce its output power. F. Touch Screen Display The touch screen display located on the front panel of the enclosure provides manual over-ride and status of the inverter’s operation. The touch screen display also provides a Stop and a Reset button. The Stop button is used when it is desired to disconnect the inverter from the power grid and the wind turbine. After Stop is pressed the inverter will remain in a powered-up stand-by mode until Reset is pressed or Grid voltage is removed. When Reset is pressed the inverter will resume normal operation. The status of the inverter’s operation is shown on the lines one and two of the display. The following table lists the status messages that may appear. Status Message Description Waiting Initializing The inverter has been reset or that the 5 minute countdown delay is in progress Waiting For Wind The voltage from the turbine is lower than the factory set auto- start voltage threshold AC Running The active rectifier is regulating the internal DC Boost voltage Running The inverter is transferring power to the utility grid Fault A fault has occurred. See fault messages 1 Pending Owner’s Manual Bergey EXCEL 15 Turbine Page 20 Manual Stop Press Reset The manual stop button has been pressed Fault Limit Press Reset Three faults have occurred in an hours time Disconnected Indicates that a communication problem exists between the display and the inverter. Check for bad cable connection. OV Power Limit The inverter has detected that the output voltage is approaching the over voltage limit and is reducing its output to compensate for the less than ideal current carrying ability of grid connection. Using the Up and DOWN arrows you can scroll through the additional Powersync III information available, as shown below. Parameter Description Grid Voltage Magnitude of the connected single phase grid voltage Grid Frequency Frequency of the connected single phase grid voltage Bus Voltage Magnitude of the DC link bus voltage DC Current Averaged value of the DC current Turbine Volts Averaged value of the rectified DC voltage from the Input Output Power Output power displayed in Watts Accumulated Energy Output Energy (kW hours) accumulated over time of operation VREF Used for factory/installer setup IREF Used for factory/installer setup Last Fault Displays the last fault that occurred since the inverter was powered up along with a fault code that may be useful when troubleshooting. Unit Code Rev Indicates the firmware revision of the control DSP Disp Code Rev Indicates the firmware revision of the LCD display DSP A hidden feature of the display is the contrast adjustment. The right side of the display has invisible up and down arrows that can be used to increase and decrease the contrast of the display. Grid Voltage This the voltage measured line to line on the output of the inverter. The voltage must be between 212 to 264Vac (184 to 228Vac for 208V units) for the inverter to operate. The line to neutral voltage"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000009",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 20,
    "text": "revision of the LCD display DSP A hidden feature of the display is the contrast adjustment. The right side of the display has invisible up and down arrows that can be used to increase and decrease the contrast of the display. Grid Voltage This the voltage measured line to line on the output of the inverter. The voltage must be between 212 to 264Vac (184 to 228Vac for 208V units) for the inverter to operate. The line to neutral voltage is important as well, although it is not reported on the LCD screen. It must be between 106 and 142Vac for both 240V and 208V units. Grid Frequency This is the frequency of the grid and determined by the utility. The frequency must be between 59.4 and 60.4 Hz for the inverter to operate. Owner’s Manual Bergey EXCEL 15 Turbine Page 21 Bus Voltage This is the voltage of the boosted DC link bus that is used to generate the output sine wave. This voltage should stay between 200 and 570 Vdc but will not trip off until it reaches 680Vdc. Auxiliary Load Current This is the current going to the auxiliary load to control the speed of the turbine. Turbine Volts This is the DC voltage of the input measured after the 3-phase AC input is rectified. The inverter will begin exporting power when this voltage exceeds 85Vdc. This voltage should never exceed 690Vdc. Vdc = Vac * 1.41 Output Power This is how much real power in Watts the inverter is currently producing or consuming if it is waiting for wind. Standby power while waiting for wind is about -10W. This measurement is not completely accurate and may not agree with an external meter. Accumulated Power This is how much real power the inverter has produced or consumed since it was last calibrated at BWC. This measurement is not completely accurate and may not agree with an external meter. VREF VREF is the input rectified voltage as a raw value. VREF = Vdc * 2.52. Vref is used as an index look-up into a virtual table used for a customizable 32 point power curve table. IREF IREF is the current request in counts for a given DC input voltage tracked by VREF. Using this configuration the inverter can be adjusted to provide any power curve required. IREF = Idc * 9 Last Fault Fault messages are displayed when a fault occurs and when the last fault parameter is selected. The following table is a list of possible faults that may be displayed. Owner’s Manual Bergey EXCEL 15 Turbine Page 22 G. Inverter Fault Codes Fault Message Fault Code Description INTERNAL ERROR 10 IGBT or control logic fault. An occurrence of this fault requires that the unit be completely powered down to reset it. Frequent code 10 faults indicate that the unit should be returned to BWC for service. DC OVER VOLT 1 1000 The DC Bus voltage has exceeded its maximum threshold. This occurs if the input power exceeds the output power. This may occur in exceptionally high winds especially if the OV Power limit is active or temperature throttling is occurring. DC OVER VOLT 2 1500 The DC Input voltage has exceeded its maximum threshold. This may occur in exceptionally high wind conditions. DC UNDER VOLT 1250 The internal DC Boost voltage has dropped below its minimum threshold. This usually indicates a configuration problem and is normally never seen. AC OVER VOLT 2030 The AC line voltage has exceeded its maximum threshold. This occurs if OV limiting was not able to influence the high grid voltage. If"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000010",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 22,
    "text": "temperature throttling is occurring. DC OVER VOLT 2 1500 The DC Input voltage has exceeded its maximum threshold. This may occur in exceptionally high wind conditions. DC UNDER VOLT 1250 The internal DC Boost voltage has dropped below its minimum threshold. This usually indicates a configuration problem and is normally never seen. AC OVER VOLT 2030 The AC line voltage has exceeded its maximum threshold. This occurs if OV limiting was not able to influence the high grid voltage. If this happens routinely consider increasing the output wire gage or making arrangements with the utility to upgrade their distribution transformer. AC UNDER VOLT 2280 The AC line voltage has dropped below its minimum threshold. It is normal to see this when the inverter has been disconnected from the grid. It may also occur momentarily when large equipment is turned on nearby. TURBINE PHASE 2500 Indicates that there is a problem with one or more of the turbine input phases. Bad connection, shorted or missing phase. When the inverter detects excessive ripple on the DC input, it shuts down to protect the turbine from destructive vibration. OVER CURRENT 3000 Phase A line current sensed by the converter module has exceeded its maximum current threshold. This may indicate that current is returning on the earth ground wire. OVER CURRENT 3020 Phase C line current sensed by the converter module has exceeded its maximum current threshold. This may indicate that current is returning on the earth ground wire. OVER CURRENT 3050 The DC Boost phase of the converter module has exceeded its maximum current threshold. Indicates a loss of boost control. Owner’s Manual Bergey EXCEL 15 Turbine Page 23 OVER TEMP 4000 The internal high temperature threshold has been exceeded. Check that unit has adequate ventilation, that the intake and exhaust vents are not obstructed, and that the cooling fans are operating. UNDER TEMP 4250 The internal low temperature threshold has been exceeded. Avoid exposing the unit to temperatures below -20ºC (-4ºF). GROUND FAULT 7000 An input phase appears to be shorted to chassis ground. It may require a high voltage measurement device such as a Megger to confirm the fault. AC OVER FREQ 8000 The frequency of the utility grid voltage went out of range. The upper range threshold was crossed. If supported (Unit Rev 1005 or greater) this code is also used to indicate that the ROCOF threshold was reached. ROCOF might occur when large equipment is switched on or off. AC UNDER FREQ 8100 The frequency of the utility grid voltage went out of range. The lower range threshold was crossed. +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ When the Powersync III is starting up after initialization, or after the RESET button has been pushed, or after a power outage, it will go through a 300 second (5 minute) countdown that is required by UL 1741. This UL standard also dictates high and low limits for utility voltage and frequency, outside of which the inverter is required to shut down until they return to the acceptable range. This is called a FAULT condition. There are a number of possible FAULT conditions during which the Powersync III will be protecting itself or the power grid. When a FAULT occurs the Powersync II will shut down (no power production) and a Fault Code will be displayed on the digital display. A list of the Fault Codes can be found in the detailed instructions for the Powersync II inverter provided in the Appendix. FAULTS will reset themselves automatically; assuming the underlying cause of the fault has been cleared, unless the inverter experiences three (3) FAULTS of any type in"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000011",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 23,
    "text": "will be protecting itself or the power grid. When a FAULT occurs the Powersync II will shut down (no power production) and a Fault Code will be displayed on the digital display. A list of the Fault Codes can be found in the detailed instructions for the Powersync II inverter provided in the Appendix. FAULTS will reset themselves automatically; assuming the underlying cause of the fault has been cleared, unless the inverter experiences three (3) FAULTS of any type in a one hour period. In this case a manual RESET is required on the digital display. CAUTION If a manual reset is required we highly recommend that you check the FAULT CODE list for indications that there is an equipment or wiring problem that needs addressing. One unique feature of the Powersync III inverter is its Soft Grid power limiting capability that can reduce the number of nuisance FAULTS on weak power lines during periods of high turbine power output. On a weak power line the EXCEL 15 wind turbine can, on a Owner’s Manual Bergey EXCEL 15 Turbine Page 24 windy day, raise the local utility voltage above the UL 1741 threshold, causing a FAULT. The Soft Grid feature tries to prevent these FAULTS by reducing power output from the wind turbine. When the Powersync II is in this mode the digital display will show “Soft Grid”. The STOP pad on the digital display will shut down the Powersync III inverter. Press the RESET pad to restart (which will start the 300 sec. countdown). If the circuit breaker in your home or business load center (circuit breaker panel) trips, it should be reset by first switching it to the OFF position and then to the ON position. If the breaker trips again immediately, or if it continues to trip after brief periods of normal operation, switch the breaker OFF and contact your Bergey dealer for assistance. The following recommendations will help ensure the safe operation of the Powersync III inverter: 1. Keep all sources of moisture away from the Powersync III enclosure. 2. Do not work near the Powersync III with gasoline, paint thinner, or any material which produces flammable vapor. Do not store flammable materials near the Powersync III enclosure. 3. Do not open the Powersync III enclosure unless the circuit breaker and Accessible Disconnect Switch (ADC) at the base of the tower have been switched OFF. Note that even with the circuit breaker and ADC switched OFF, a shock hazard will still be present inside the Powersync III enclosure for approximately 15 minutes (as the capacitor voltage drains down). 4. Do not block airflow around the Powersync III enclosure in any way. A six- inch clearance must be maintained around the sides, top, and bottom of the enclosure for adequate air circulation. VI. TURBINE INSTALLATION Please use the following instructions in assembling and commissioning your system. If you need any additional information, please contact us. A. BWC EXCEL WIND TURBINE and TOWER Please refer to the BWC EXCEL 15 Installation Manual, and any addendum for the specific tower design, for instructions on installing the wind turbine and tower. Owner’s Manual Bergey EXCEL 15 Turbine Page 25 B. FUSED DISCONNECT SWITCH The electrical output of the wind turbine is a three-phase alternating current (AC). We strongly recommend the installation of a fused three-phase AC disconnect switch between the wind turbine and the Powersync II, as shown in the drawing on Page 26. This switch is commonly referred to as an Accessible Disconnect Switch (ADC) and most utilities will require one to be installed. A 60A weather-tight switch box"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000012",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 24,
    "text": "tower. Owner’s Manual Bergey EXCEL 15 Turbine Page 25 B. FUSED DISCONNECT SWITCH The electrical output of the wind turbine is a three-phase alternating current (AC). We strongly recommend the installation of a fused three-phase AC disconnect switch between the wind turbine and the Powersync II, as shown in the drawing on Page 26. This switch is commonly referred to as an Accessible Disconnect Switch (ADC) and most utilities will require one to be installed. A 60A weather-tight switch box with 45A fuses for the 240 VAC, 60Hz or 220VAC, 50Hz system is recommended. The fuses will help protect the alternator in the event of a wiring, controller, or load short circuit. The fused disconnect switch is normally installed at the base of the tower. CAUTION Do not install a permanent “short circuiting switch” that will provide dynamic braking of the alternator. These switches can be easily misused, leading to serious damage to the alternator. Such damage is not covered by the BWC warranty. C. WIRE RUN AND WIRE SIZES Please refer to the BWC EXCEL 15 Installation Manual for recommended wire and conduit sizes for the tower-to-Powersync III wire run. Refer to the row labeled “BWC Excel 15” for appropriate wire sizes. D. POWERSYNC III INVERTER The Powersync III inverter should be installed indoors, near the main breaker enclosure if possible. The Powersync III is designed to operate in a clean environment and should never be installed outdoors as it is not weatherproof and will be damaged by rain. A minimum of six inches of clearance is required on the top, bottom and sides of the Powersync III to ensure adequate air flow through the enclosure. The Powersync III should be connected to a dedicated 125A two-pole breaker installed in the main breaker box. System grounding is accomplished by attaching a wire, # 8 AWG minimum, from the grounding lug inside the Powersync III enclosure to the panel ground inside the main breaker box. Additionally, the tower “bond” ground wire should be connected to the grounding lug inside the Powersync III enclosure. A typical system wiring schematic for the Bergey EXCEL 15 is shown below. The three AC connections from the wind turbine can be connected to the Powersync II terminals in any order; there is no required phase orientation. DANGER Do not attempt to make the Powersync III connections with energized leads. Always have the wind turbine fully disconnected and the circuit breaker switched to “off” before making the Powersync III connections. Owner’s Manual Bergey EXCEL 15 Turbine Page 26 All wiring should conform to the National Electric Code or other governing local electrical code. The use of electrical conduit for wiring between components is highly recommended. All terminations should be coated with an anti-oxidation compound to prevent corrosion. CAUTION All loads should be equipped with fuses or circuit breakers to avoid hazards from accidental short circuits. 10 kW Wind Turbine 24 m (80 ft) GuyedTower Safety Switch Power Processing Unit (Inverter) Cummulative Production Meter AC Load Center Owner’s Manual Bergey EXCEL 15 Turbine Page 27 VII. INSPECTIONS AND MAINTENANCE The Bergey EXCEL 15 turbine and tower should be inspected once 90 - 180 days after installation to ensure that no hardware was missed and there are no issues with the turbine. Following this post-installation inspection, the complete system should be inspected every four years and after any particularly severe weather. Inspections should be done on days when the wind is below 20 mph (9 m/s). Check List for Inspections 1. On guyed towers inspect each of the anchor points. Ensure that all hardware is secure and the"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000013",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 27,
    "text": "be inspected once 90 - 180 days after installation to ensure that no hardware was missed and there are no issues with the turbine. Following this post-installation inspection, the complete system should be inspected every four years and after any particularly severe weather. Inspections should be done on days when the wind is below 20 mph (9 m/s). Check List for Inspections 1. On guyed towers inspect each of the anchor points. Ensure that all hardware is secure and the guy wires are properly tensioned. Check to ensure that no strands are broken and the turnbuckle safety cables are in place. WARNING: Loose guy wires or unsecured turnbuckles can lead to tower failure. 2. Disconnect the inverter at the breaker panel, which will bring the turbine to a stop. Climb the tower. Always use proper safety climbing gear and safe climbing practices. DANGER Only qualified personnel with proper safety equipment should climb the tower. Never climb the tower when the rotor is turning. 3. Inspect the blades for: A. Cracks in the inner 4 ft. of each blade. This is the most highly stressed portion of the blade. B. Leading or trailing edge damage. Pay particular attention to the leading edge near the tip of each blade. C. Condition of the paint. 4. Remove the spinner and hang it from the machine. Check the marker lines on each of the blade attachment and torque plate bolts, retorquing and remarking any bolts that have loosened. Check the front bearing for seal integrity and excessive grease loss. Reattach the spinner and check that it is secure. 5. Open the cover plate on the mainframe. Inspect the slip-rings and brushes. Inspect the back-up brake circuit boards. Owner’s Manual Bergey EXCEL 15 Turbine Page 28 6. Check the rear alternator bearing for seal integrity and excessive grease loss. 7. Inspect the mainframe for cracks. 8. Check for cracks or loose hardware on the tail boom and fin. 9. Check for corrosion on the alternator. Clean and repaint as needed. 10. While descending the tower, inspect the following: A. Check that the tower wiring is properly secure. B. Check all fasteners. C. Look for any cracks in the tower structure. D. Check the condition of the guy wire attachment (guyed towers). 11. Check the connection on all ground rods and hardware. 12. Check the disconnect switch. 13. Inspect the wire run, particularly all electrical connections. 14. Check condition of all wiring connections into and out of the Powersync II. 15. Check the fan filters on the Powersync III. 16. Switch the turbine breaker in the breaker panel to ON. Move to a spot where you can observe the turbine. Listen to the sound of the machine as it speeds up. No mechanical sounds, such as a \"clunking\" or \"banging,\" should be heard. Also watch for any new or significant vibration. The turbine operation should be smooth. Owner’s Manual Bergey EXCEL 15 Turbine Page 29 VIII. Trouble-Shooting Problems The following guide can help to pin-point the cause of operational problems with the Bergey EXCEL 15 wind turbine and the Powersync III inverter For problems or symptoms not found in the following listing please contact the Service Department at Bergey Windpower Co. at Tel. No. 1-405-364-4212, Telefax No. 1-405-364-2078, or E- mail: service@bergey.com Problem Cause(s) Diagnosis Remedy Turbine makes an unusual blade sound, such as whistling or buzzing 1. Damaged blade leading edge 2. Blade structural damage 1. Have leading edge inspected 2. Have blades inspected. Cracks outboard of the hub can lead to blade failure. 1. Consult Bergey Service Department 2. If blade damage is suspected,"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000014",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 29,
    "text": "not found in the following listing please contact the Service Department at Bergey Windpower Co. at Tel. No. 1-405-364-4212, Telefax No. 1-405-364-2078, or E- mail: service@bergey.com Problem Cause(s) Diagnosis Remedy Turbine makes an unusual blade sound, such as whistling or buzzing 1. Damaged blade leading edge 2. Blade structural damage 1. Have leading edge inspected 2. Have blades inspected. Cracks outboard of the hub can lead to blade failure. 1. Consult Bergey Service Department 2. If blade damage is suspected, the turbine should be stopped until it is inspected. Contact your dealer. Rotor is unbalanced, causing the turbine to move slightly back and forth as it spins 1. Uneven ice build-up on blades 2. Blade damage 1. Ice on turbine and tower. Turbine ran smoothly before ice storm. Slow rotor speed. 2. No ice. Turbine ran smoothly before 1. Do nothing – ice will dislodge in a few days. No not approach the tower. 2. If blade damage is suspected, the turbine should be stopped until it is inspected. Contact your dealer. Owner’s Manual Bergey EXCEL 15 Turbine Page 30 Problem Cause(s) Diagnosis Remedy Turbine makes a banging or rattling sound once per revolution, particularly at low speeds 1. Loose spinner 2. Alternator rear bearing ring fasteners loose or missing 3. Alternator bearings 1. Sound is once per revolution. Inspect spinner. 2. Sound is once per revolution. Inspect rear of alternator 3. Excessive grease leakage. Squeaking sounds at low speed. 1. Have spinner inspected 2. Have alternator inspected 3. Have alternator inspected Turbine makes a “fog horn” sound at certain, typically low, wind speeds Electro-mechanical interaction between alternator and inverter that causes transient vibrations in the turbine Sound comes and goes, but occurs at the same wind speed(s) This is normal, but contact your dealer or the Bergey Service Department if the noise is excessive Turbine makes a continuous growling or rumbling sound, which reduces at higher wind speeds 1. Wiring fault 2. Inverter fault 3. Alternator bearings Switch fused disconnect on tower to OFF. If growling disappears an electrical problem is indicated. If growling continues a mechanical problem is indicated 1. Check fuses. Check wiring for continuity, phase-to-phase fault, or short to ground. 2. After completing the wiring check, disconnect the inverter and reconnect wiring to the turbine. If the noise disappears an inverter problem is indicated. 3. Check for excessive grease loss 1. Repair or replace as needed 2. Contact your dealer 3. Have the alternator inspected Owner’s Manual Bergey EXCEL 15 Turbine Page 31 Problem Cause(s) Diagnosis Remedy Rotor turns slowly and does not speed up in higher winds 1. Ice build-up on blades 2. Short circuit in wiring or inverter 3. Short circuit in tower wiring, slip-rings, or alternator 1. Check for ice 2. Open tower disconnect. If turbine spins freely an electrical system problem is indicated 3. The most likely problem is a shorted alternator. 1. Do nothing – ice will dislodge in a few days. No need to furl the turbine. 2. Contact your dealer 3. Contact your dealer Rotor does not turn at all Mechanical failure inside alternator Rotor does not turn even when winds exceed 15 mph (6.7 m/s) Contact your dealer Powersync III display not functioning 1. No power to inverter 2. Display or other inverter component not functioning properly 1. Turn off utility power to inverter, using the dedicated breaker in your breaker panel, for a minimum of 20 seconds. Then turn power back on using the breaker. Wait 300 seconds (5 minutes). If inverter does not resume operation, with full display functionality, contact your dealer Owner’s Manual Bergey EXCEL"
  },
  {
    "chunk_id": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf-0eefdb50::chunk_000015",
    "source": "Excel-15S-Owners-Manual_August-2018_Rev-0.pdf",
    "page": 31,
    "text": "when winds exceed 15 mph (6.7 m/s) Contact your dealer Powersync III display not functioning 1. No power to inverter 2. Display or other inverter component not functioning properly 1. Turn off utility power to inverter, using the dedicated breaker in your breaker panel, for a minimum of 20 seconds. Then turn power back on using the breaker. Wait 300 seconds (5 minutes). If inverter does not resume operation, with full display functionality, contact your dealer Owner’s Manual Bergey EXCEL 15 Turbine Page 32 IX. Appendix Owner’s Manual Bergey EXCEL 15 Turbine Page 33 Owner’s Manual Bergey EXCEL 15 Turbine Page 34"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000000",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 1,
    "text": "Maintenance Manual for “Piggott“ Small Wind Turbines Version 3.2 WindEmpowerment 2018 Gaël Cesa , Marie-Laure Brunel , Jérôme Strasilla Content & Layout: Maintenance Working Group: Marie-Laure Brunel, Gaël Cesa, Jérôme Strasilla Publishing date: March 2018 Acknowledgement: Hugh Piggott, Jon Summanik-Leary, Jay Hudnall, Valéry Benton, Christophe Glaziou In collaboration with: Funded by: Maintenance Manual for “Piggott“ Small Wind Turbines Version 3.2.1 Grundlagenrecherche Content......................................................................................................... Preface & introduction................................................................................ Safety & precautions.................................................................................. Environmental factors.................................................................................. Tool list......................................................................................................... Lowering and raising the turbine............................................................... Securing the area and the WT system......................................... Lowering the WT....................................................................... Disassembling the WT................................................................. Reassembling the WT............................................................................. Raising the tower..................................................................................... Maintaining your wind turbine system........................................................ Blades............................................................................................ Alternator & frame..................................................................................... Tower & foundation..................................................................................... Electrical system..................................................................................... Service frequency......................................................................................... Check list........................................................................................................ Troubleshooting............................................................................................. Logbook........................................................................................................ Appendix....................................................................................................... page 3 page 4 page 5 page 6 page 9 page 12 page 12 page 15 page 17 page 18 page 19 page 21 page 21 page 23 page 29 page 31 page 36 page 37 page 40 page 43 page 45 1 2 3 4 5 6 7 8 9 10 5.1 5.2 5.3 5.4 5.5 6.1 6.2 6.3 6.4 Content Content Maintenance Manual 3 Grundlagenrecherche1 Preface & Introdcution 1 Preface & introduction Preface The present document is a maintenance manual for “Piggott“ based designed small wind turbines (SWT), developed by WindEmpowerment (WE) association (http://www.windempowerment.org). Founded in Senegal in 2011, WindEmpo- werment is involved in the development of locally manufactured small wind turbines for sustainable rural electrification around the world. Wind Empowerment’s Maintenance Working Group (WG) was formed in Athens during the 2 nd global conference, with the following group vision: “To mutually empower people to keep their turbines running.” Tripalium (French network for Piggott wind turbines: http://www.tripalium.org) produced the first two versions of a main- tenance manual that has been translated into an english version for WindEmpowerment. The 3rd version is the result of 6 months of teamwork. The objective is to increase users autonomy for producing their own electricity by being able to operate and maintain their wind turbines. This manual is available as a free download at the WE and WE members website. However donations are suitable to support a future edition of this maintenance manual. All SWT operators are invited to download and print the manual and keep it close to their turbine. Introduction Wind turbines are a fascinating way to produce electricity and increase energy autonomy. On a good site you can pro - duce most of your needs with the fruit of your endeavours. Many wind turbines inspired and based on a concept deceloped by Hugh Piggott have been manufactured all around the world. Whilst most of the turbines built according to these specifications performed well initially, many broke down after some time due to a lack of appropriate maintenance. This is a particular problem for WE-members who implement electrification projects in remote areas of developing countries, where local technical capacity to perform repairs is low and travel time to reach installation sites are particularly long. This 3 rd maintenance manual edition includes preventative and corrective maintenance according to common issues based on our experience and the WE-members feedback from around the world. It takes into account environmental factors influencing maintenance needs, a list of the tools that you need to perform the maintenance steps, more detailed maintenance procedures, troubleshooting, a check list and finally a crash page with stories of what went wrong at different SWT installation sites. Nevertheless, other events not listed can occur. For this reason this document is meant to to be updated in the future. A database will be available online to monitor SWT maintenance actions but also failures or breakdowns"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000001",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 4,
    "text": "account environmental factors influencing maintenance needs, a list of the tools that you need to perform the maintenance steps, more detailed maintenance procedures, troubleshooting, a check list and finally a crash page with stories of what went wrong at different SWT installation sites. Nevertheless, other events not listed can occur. For this reason this document is meant to to be updated in the future. A database will be available online to monitor SWT maintenance actions but also failures or breakdowns that occured, so we encourage you to give us your feedback at windempowerment.group@gmail.com to help us to improve future editions.This manual is mainly focused on Piggott SWT design concept with guy wired tower, for off-grid and grid-tied systems. However, it can also be useful for commercially manufactured turbines. We hope this work will help you to operate and maintain your turbine so it can reach it‘s full potential. Maintenance Manual 4 Grundlagenrecherche 2 Safety & precautions Unlike most of maintenance manuals for manufactured goods, we strongly encourage you to take apart your turbine. Check the weather forecast before planning a maintenance service. Before any maintenance action it is absolutely essential to: Stop the wind turbine switchin ON the short-circuit brake (figure 1). Mechanical hazards Disassembling the permanent magnet generator: The rotors have very powerful magnets, therefore it is dangerous to have metal objects or tools close to the rotors. When the two rotors are removed, they must be stored at the appropriate distance from each other, at least 1.5 m. Be careful when you dismount the blades to store them in a safe place to avoid any damage. 2 Safety & precautions Maintenance Manual 5 Fig. 1: Brake switch Electrical hazards Power cables Risk of electroshock from touching the live wires for 48V and grid-tied systems (400V), especially if you disconnect a cable and as a consequence your turbine is spinning freely. Batteries • A short circuit in the wires connected to the batteries can cause a burning or an explosion. • Charging a lead-acid battery emits hydrogen, which is highly explosive. • Make sure that the area where the battery is located is well ventilated. • Watch out for sparks, flames and other sources of ignition! Magnets If you have a pacemaker or other medical devices, stay away! The permanent magnet generators have a particularly powerful magnetic field . Safety gear We recommend you to wear safety equipment like gloves, safety shoes and a safety helmet. But remember that the best safety is to work intelligently and making sure the people around you are equally behaving in a responsible manner. Safety should be your primary concern during all maintenance actions performed on your small wind installation and particularly when raising and lowering the tower. Be attentive for risks that may arise from both electrical and mechanical components. Grundlagenrecherche 3 Environmental factors The following table provides an overview about factors that can significantly influence the life span of a SWT. The worst enemies of SWT are: • Strong winds & turbulent wind conditions • W a t e r • Salt • Sand/erosion • Lack of maintenance 3 Environmental factors Maintenance Manual 6 Tab. 1: Environmental factors influencing the life span of a SWT Factors Risks Countermeasures Main sensitive parts Lightning Destruction of the system (turbine and electronics) In grid-tied system: Risk to burn the inverter and elec - tronics from a strike on the grid All the guy wires should be connected together with the tower to a ground rod (figure 2) or at least connected to the ground next to each anchor. The electrical system should also be"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000002",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 6,
    "text": "Maintenance Manual 6 Tab. 1: Environmental factors influencing the life span of a SWT Factors Risks Countermeasures Main sensitive parts Lightning Destruction of the system (turbine and electronics) In grid-tied system: Risk to burn the inverter and elec - tronics from a strike on the grid All the guy wires should be connected together with the tower to a ground rod (figure 2) or at least connected to the ground next to each anchor. The electrical system should also be connected to the same ground rod via a ground cable to the tower. Be sure there is a lightning arrester between the tower and the electronics. On a grid-tied connection, be sure there is a lightning arrestor between the grid and the inverter. • electronics • anchors Saline air Corrosion of magnets (co - mes from the rust inside the resin), guy wires and all metallic parts (tower, frame, etc.) Wear of components made of plywood (especially if poor quality plywood) Protect exposed metal materials and rotors of the WT with a painting against corrosion. Change rusted fastenings and guy wires by stainless ones. If you have galvanized ones, protect them with old car oil or other kind of grease. If the magnets are corroded, build new rotors and paint or galvanise the disks, and use expoy resin. Use also epoxy coating magnets Use high quality plywood or change by metal parts. • neodynium magnets • guy wires • other metalic part (frame, tail, tower) • plywood parts Hail Blades affected by erosion Tail damaged The paint on metal parts can be removed Fix holes and eroded parts with epoxy resin and protect the blades with paint or polyurethane varnish. Protect the plywood tail with resin or polyurethane varnish. • blades • tail If a wind turbine is running below one or more of these factors, it will require more frequent preventative maintenance. Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 7 von 46 Grundlagenrecherche3 Environmental factors Maintenance Manual 7 Tab. 1: Environmental factors influencing the life span of a SWT Factors Risks Countermeasures Main sensitive parts Sandy environment Abrasive effect, strong wear on the leading edge of the blades, and on the whole system Paint your blades with layers of different colours. If a layer of colour gets exposed by erosion, refurbish the blade surface with a new layer. Put some tape on the leading edge to protect the blades, or protect them with epoxy resin. Remove the sand at the tower base regularly (figure 3). Protect chains by pouring them into concrete (figure 4). Protect guy wires and fittings with oil or grease (can also be old car oil) • blades • base of tower • anchors • metal parts Hot-dry climates Overheating of electrical components (High tempera- tures can reduce the battery life by more than 75%) Don‘t paint the stator, it will help the cooling of the coils by ambient air. Make sure all electrical components are ventilated and not enclosed. Make sure batteries are air-cooled: surelevate them on a wooden palet- te, try air-conditionning, and make a good insulation of the battery room. • electric and electro- nic components Cold climates Icing leads to cracks and imbalanced blades Infiltration of snow and ice into the junction boxes and resin leads to cracks Check the waterproofness of the junc- tion boxes and the wire connections inside, change them if necessary. Check and repair holes and cracks in the blades and resin components. • blades • electrical connections Fig. 2: Ground connection of the tower and electronics Fig 3: Sand at the tower base Seminarhaus ökologischer Schaugarten - Witzenhausen"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000003",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 7,
    "text": "nic components Cold climates Icing leads to cracks and imbalanced blades Infiltration of snow and ice into the junction boxes and resin leads to cracks Check the waterproofness of the junc- tion boxes and the wire connections inside, change them if necessary. Check and repair holes and cracks in the blades and resin components. • blades • electrical connections Fig. 2: Ground connection of the tower and electronics Fig 3: Sand at the tower base Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 8 von 46 Grundlagenrecherche3 Environmental factors Maintenance Manual 8 Tab. 1: Environmental factors influencing the life span of a SWT Factors Risks Countermeasures Main sensitive parts Storms Strong vibrations on the whole system might break the blades and/or tail Lower the turbine if a storm is predicted or inspect your turbine after the storm. We recommend to let the turbine run - ning because when it is stopped, a high wind speed can be stronger than the BEMF with a risk to burn the coils and the blades keep on-wind, which me - ans stronger mechanical forces on the blade area, with higher risk of failure. • turbine • tower Turbulence Electrical cable at the bottom of the tower twists more frequently Vibrations on the whole turbine and tower may inc- rease the risk of failures Furling system wear Use a higher mast to rise the wind turbine above the surrounding vege- tation and obstacles. Untwist the cable at the bottom of the tower more frequently. Check the blade balancing more often. Strengthen the tail vane. • electrical cable • turbine • tower Rain Infiltration of water in bla- des, plywood, rotors and junction boxes Corrosion Check and repair holes and cracks in the blades and resin parts. Be sure the junction boxes are still waterproof or replace them. Protect the plywood tail with resin or polyurethane varnish. • electrical com- ponents • rotor • stator • blades Fig. 4: Guy wires protected by oil Fig. 5: Chain poured into concrete Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche 4 Tool list 4 Tool list Maintenance Manual 9 To lower and raise the tower: Tab. 2: Tool list to lower and raise the tower Designation Qty. Characteristics Pulling wire grip hoist and its cable (and pulley for 24m tower) 1 Up to 2m40 & 18m height: 800kg; 20m cable From 3m; 18m or 24m height: 1,6t; 25m cable Spanner 2 Large size (22, 24 or 26...) for tower & gin pole Cords 1 or 2 3 x gin pole length in total Multi-use pliers 1 Large one Shackle 3 Equal or greater to the grip hoist maximum pulling strengh Lubricant 1 WD40 type Tripod or sawhorse 1 High enough to avoid blades touching the ground To disassemble, check and repair the turbine: Tab. 3: Tool list to dismount, check and repair the turbine Designation Qty. Characteristics Tower Blades Alternator Frame/tail Elec. Hammer/mallet 1 X Spanners 2 of each Current sizes for WT: 17, 19, 22 X Adjustable wrench 1 Large enough for the bearing nut X Small spanners 2 of each 8 to 13 X X X Screwdrivers 2 1 small (to unscrew the terminal blocks) and 1 normal bit X Cross (or Phi- lipps) screw- drivers 2 2 different sizes: 1 small and 1 bigger X Cutting clamp 1 X X Universal pliers 1 X X Jacking screws 3 X Cordless drill/ bit with cross bit 1 X Rags 2 X X X X Files 1 X Multimeter 1 X If your installation is particular (e.g., if the gin pole is disassembled) consider that you may need more tools and"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000004",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 9,
    "text": "(to unscrew the terminal blocks) and 1 normal bit X Cross (or Phi- lipps) screw- drivers 2 2 different sizes: 1 small and 1 bigger X Cutting clamp 1 X X Universal pliers 1 X X Jacking screws 3 X Cordless drill/ bit with cross bit 1 X Rags 2 X X X X Files 1 X Multimeter 1 X If your installation is particular (e.g., if the gin pole is disassembled) consider that you may need more tools and some specific parts. Grundlagenrecherche4 Tool list Maintenance Manual 10 Consumables and spare parts: Tab. 4: List of consumables and spare parts Designation Qty. Characteristics Sand paper 1 Different grits Silicone 1 Wood glue 1 Linseed oil 1 Optional Epoxy resin & hardener 1 Polyurethan varnish 1 In 2 components Epoxy glue 1 In 2 components Brushes 3 Anti-corrosive paint 2 White spirit 1 Grease 1 Grease remover 1 Like window cleaner Threadlock 1 Optional Electrical tape 1 Iron wire 1 or 2m Packs of plastic cable ties 2 Small ones and large ones Nuts 6 of each M6, M8, M10, M12 and/or M14; stainless steelBolts 6 of each Washers 6 of each D6, D8, D10, D12 and/or D14; normal and large ones; stainless steel Wooden screws 20 M5; zinc or stainless steel Cable clamps 20 6 or 8 (according to guy wire diameter); galva steelThimbles 10 Shackles 4 of each 8 and 12 diameter Turnbuckles 2 For 6 or 8mm diameter guy wires Junction box 1 Cables 1m of each Mono strand, 2.5mm², 4mm², 6mm², 10mm² Electrical terminal blocks 6 of each 10 and 16mm² Crimp lugs 10 of each Different sizes Fuses 2 Check characteristics of the system (maximum current) Set of rolling bearings 1 Grundlagenrecherche4 Tool list Maintenance Manual 11 Additional materials: In case an important reparation (corrective maintenance) needs to be performed on a SWT-system, find out the state of the damages from the operator as precise as possible before going on site, especially on far and remote locations. Take more tools, materials and more spare parts than the ones listed above, and other spare parts, in case of unfore- seen damages. Tools: • Grinder machine with sand, cut and flap disks • Generator and oil • Drill • Portable welding machine Spare parts: Tab. 5: Additional spare parts Spare parts Qty. Characteristics A set of 3-phase cable 15-25m According to tower height, check for initial cable diameter Brake switch Same characteristics as the original Rectifier and heat sink Metal parts (flat, angle, pipe) For blade balancing and for frame/tail/tower Removable balancing tower For balancing the blades Threaded rods 2m M12 or M14, stainless A set of guy wires D6, 50m Galvanised or stainless Marine plywood triangle, disk, tail Check for original thickness Fig. 6: Usual tools Fig. 7: Consumables Grundlagenrecherche 5.1 Secure the area and the whole system Safety warnings: A helmet is compulsory for people working in the perimeter of a seize as follows: Circle radius equal to tower height (people without helmet should be kept outside the working area that is displayed in figure 9. Only 1 person is leading all operations and explains the risks and precautions to others Nobody is allowed to stand in or to pass the lowering tower direction during all the operation (see the red dangerous area in figure 9)! Be sure that the wind speed is below 7m/s After checking your system in Operation (see section 6), Switch ON the circuit brake (see figure 8). Check and remove any obstacles that can disturb the operation, especially at the base, anchors, and in the lowering direction area. Make sure"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000005",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 12,
    "text": "the risks and precautions to others Nobody is allowed to stand in or to pass the lowering tower direction during all the operation (see the red dangerous area in figure 9)! Be sure that the wind speed is below 7m/s After checking your system in Operation (see section 6), Switch ON the circuit brake (see figure 8). Check and remove any obstacles that can disturb the operation, especially at the base, anchors, and in the lowering direction area. Make sure the electric cable will not be pinched during the process. 5 Lowering and raising the turbine 5 Lowering and raising the turbine Usually the tower of a Piggott wind turbine is made of pipes assembled and kept in vertical position with guy wires. Turbine lowering and raising operations are done with a gin pole and a grip hoist. It can be dangerous don‘t take unne- cessary risks. The main risk is the tower falling down with the turbine . In worst case, a person can be seriously injured. This can happen in case of: • One or several guy wires break on the same side. • A grip hoist cable breaks or the cable is released abnormaly (problem with the break lever of the grip hoist) • Strong wind To prevent these risks, follow the precaution safety operations. A team of at least 2 experienced people is required but 4 people make the work a lot easier. Maintenance Manual 12 Fig. 8: Brake switch For the electrical inspection it is important that your turbine is operating. Therefore go to section 6.4 to see the steps that need to be done before lowering the turbine. Grundlagenrecherche Installing the pulling grip hoist Note: it‘s assumed that the gin pole is already fastened to the tower. If this is not the case, you will need to install the gin pole between the foot of the tower and the lift anchor. Start by attaching the grip hoist to the head of the gin pole and the lift anchor. One by one (or together if they are attached at the same part), detach the guy wires from the lift anchor to the head of the gin pole. The tower should always be attached to prevent it falling over. 5 Lowering and raising the turbine Fig. 9: Working area and safety zone Maintenance Manual 13 Fig. 10: Wire pulling grip hoist Brake Release Lever Pulling Lever Fig. 11: Extremity of the gin pole with the grip hoist Insert the full wire from the extremity without hook into the hole, going out from the pin side. Fasten the grip hoist to the lift anchor with a strong shackle and fasten the grip hoist hook to the gin pole extremity plate with another shackle (figure 11). Install the grip hoist properly: Release the grip hoist brake (‘Brake‘, figure 10) Pulling Lever : To raise the tower Release Lever : To lower the tower Brake : ON to activate the hoist OFF as on figure 10 Grundlagenrecherche Engage the grip hoist brake (see figure 10). Fasten 2 cords between the gin pole and each side anchor (see figure 11). Fasten a cord or a strap on the guy wire in the lowering direction (used to pull the guy wire helping to lower the tower at the beginning of the operation): Unscrew the turnblucke that connects the gin pole with the anchor (it can be a piece of chain or guy wire). Remove the safety wire that locks the turnbuckles: Put a support like a saw horse or a shipping crate in the lowering direction, where the top of the"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000006",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 14,
    "text": "Fasten a cord or a strap on the guy wire in the lowering direction (used to pull the guy wire helping to lower the tower at the beginning of the operation): Unscrew the turnblucke that connects the gin pole with the anchor (it can be a piece of chain or guy wire). Remove the safety wire that locks the turnbuckles: Put a support like a saw horse or a shipping crate in the lowering direction, where the top of the tower is expected to touch the ground. Place a wooden palette close-by in order to support the tail (see figure 16) so that the blades are facing the sky. 5 Lowering and raising the turbine Maintenance Manual 14 Fig. 12: Strap on the top guy wire (lowering direction) Fig. 13: Guy wire fastenings and safety wire Grundlagenrecherche 5.2 Lower the wind turbine Start activating the front lever (see figure 10) to release the gin pole while pulling on the back guy wire with the strap or cord to help lowering the tower, away from the tower ! as on figure 14 : Continue to lower the tower and check that the tower and the gin pole are vertical at any time, otherwise warn the lateral anchor operator to adjust the cord tension. If the tower is oscillating, reduce the rythm of lowering. 5 Lowering and raising the turbine Maintenance Manual 15 Fig. 14: Pulling top guy wire strap Fig. 15: Lowering the tower Manpower (4 people if possible): • One person operating the grip hoist, checking the verticality of the tower and the gin pole, aware of any abnormal thing, and being in command of the team • One person per side anchor maintaining cords and controlling wire tension • One person at the back anchor, away from the lowering direction, pulling the guy wire Grundlagenrecherche Once the turbine is closer to the ground, adjust the saw horse position taking care that the blades neither touch the ground nor the saw horse. When you can reach the turbine, 2 people take the tail carefully and orientate it so that the blades are facing up - wards and avoid to turn over. Place the tail in furling position and lean it against a support like a wooden palette to keep the turbine stable. In case of a problem you can stop activating the grip hoist and even raise back the tower back at any time if necessary changing the arm onto the pulling lever). Slacken more turnbuckles and even cable clamps if wires are too tensed (should not happen if anchors are well aligned and at the same level) 5 Lowering and raising the turbine Maintenance Manual 16 If you have to leave the tower down for a long time, don‘t leave the grip hoist in the rain or snow. Take down the gin pole, and remove the grip hoist temporary. Fig. 16: Turbine lowered Grundlagenrecherche Removing the alternator & frame First, remove the tail from its hinge while someone holds the alternator. If there is a losse washer on the top of the tower, remove it. Disconnect the 3-phase cable into the junction box and remove the alternator and frame from the tower top hinge. For testing and inspection see section 6.2 Alternator and frame. Removing the blades Before removing the blades, make sure there is a mark to locate the position of the rotor blades towards the alternator and a threaded rod. If not, make a mark on a threaded rod and on the triangle that supports the blades (figure 17) Remove the nuts and washers and take the"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000007",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 17,
    "text": "into the junction box and remove the alternator and frame from the tower top hinge. For testing and inspection see section 6.2 Alternator and frame. Removing the blades Before removing the blades, make sure there is a mark to locate the position of the rotor blades towards the alternator and a threaded rod. If not, make a mark on a threaded rod and on the triangle that supports the blades (figure 17) Remove the nuts and washers and take the blades off slowly by pushing it at the root of each blade at the same time. Put it in a safe place, where nobody can damage it. 5 Lowering and raising the turbine Fig. 18: Marks on blades and triangle Fig. 17: Mark on a threaded rod and triangle Maintenance Manual 17 If you need to dismount the blades, be sure there are some marks on each blade and on each maintaining piece (disk and triangle) to locate their position (figure 18), before disassembling them. If not, make these marks . Be careful that the 3-phase cable does not slip down inside the tower, hold it ! Make a knot with the cable or fix something to the cable. 5.3 Dismount the wind turbine According to the maintenance level, you will not need to remove the alternator, but just the blades. In this case, skip the part “Removing the alternator & frame“ and go directly in the next section “5.4 Reinstalling the turbine”, “Reinstalling the blades“. Grundlagenrecherche 5.4 Reinstalling the turbine Reinstalling the alternator & frame Insert the washer (if it is apart of the tower stub) on the top of the tower and apply some grease on it and on the tower stub. Fasten an iron wire at the extremity of the 3-phase cable coming from the tower and insert the cable with the iron wire inside the yaw pipe of the frame. Connect the 3-phase cables in the junction box, if necessary put new terminal blocks and fasten the cables to the frame with cable ties. Put some grease on the tail hinge. Insert the tail onto the hinge in furling position while 1 or 2 persons push the alternator to orientate the studs to- wards the sky. Place the tail against its support (see figure 20 below). 5 Lowering and raising the turbine Fig. 19: Installing the alternator & frame Fig. 20: Installing the tail Maintenance Manual 18 Fig. 21: Installing the blades Reinstalling the blades Be sure that alternator and tail are stable before mounting the blades Check for the marked threaded rod, place and insert the blades prudently. Put the washers and nuts. Before tightening, check the position of the blades towards the tower: put each blade (one by one) parallel to the tower to check the distance between the blade tip and the tower. Repeat the operation for each blade to get the same distance everywhere. Adjust the clamp of each nut to set the gap between each tip blade and the tower (tighten the nut of a blade more if it is too far from the tower) Screw and tighten the lock-nuts and eventually apply threadlock for each nut. Grundlagenrecherche 5.5 Raise the tower Place the arm on the pulling lever of the grip hoist and start to activate the lever slowly, while holding the tail and the blades (figure 22) because they will try to open abruptly and they can touch the ground (and be damaged). Don‘t stay below the tower ! Fig. 23: Grip hoist to raise the tower Fig. 22: Holding tail and blades 5 Lowering and raising the turbine"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000008",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 18,
    "text": "eventually apply threadlock for each nut. Grundlagenrecherche 5.5 Raise the tower Place the arm on the pulling lever of the grip hoist and start to activate the lever slowly, while holding the tail and the blades (figure 22) because they will try to open abruptly and they can touch the ground (and be damaged). Don‘t stay below the tower ! Fig. 23: Grip hoist to raise the tower Fig. 22: Holding tail and blades 5 Lowering and raising the turbine Maintenance Manual 19 Once the tower is almost in vertical position, pull on the lowering direction top guy wire with the fastened strap (see figure 14). That avoids the tower making an abrupt motion to drop into the vertical position because the weight of the gin pole is pulling the tower backwards. At the end of the operation, check the vertical position of the tower with a level in all 4 directions, and also by eye for upper parts of the tower (see figures 24 & 25). Check the tension of all guy wires and adjust them. Tighten the turnbuckles and/or adjust the cable clamp positions. Everybody goes back to each anchor as described above in 5.2 Lower the wind turbine. At least 2 people staying close to the turbine. Make sure the strap is still in position on the top guy wire in lowering direction. Grundlagenrecherche Fasten the turnbuckle linked to a chain or a piece of a guy wire to the lift anchor. Once the gin pole is fastened securely, remove the grip hoist (hook, shackles, etc.) and the lateral cords. Check that all guy wires and all fastenings like cable clamps, turnbuckles and shackles are well tightened and secured. Secure the turnbuckles with a guy wire or a piece of an iron wire (see figure 13). Finally unleash the turbine (switch OFF the brake). Fig. 24 : Verticality check at the bottom of the tower 5 Lowering and raising the turbine Maintenance Manual 20 Before removing the grip hoist, the gin pole should be fastened to the anchor point. Fig. 25 : Verticality check of the upper parts of the tower Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 21 von 46 Grundlagenrecherche 6. Maintaining your wind turbine system 6.1 Blades Wooden blades Inspect the general condition of the blades. Look for cracks, holes and other damages. Take special care of the leading edge. If the leading edge is damaged you can fix it using epoxy resin. You can reinforce it using blade tape. Even though blade tape is expensive it gives very good results. If you observe severe crack in the direction of the wood fibre, you might need to replace the blade. It is very important to put a new layer of blade surface protection (linseed oil, polyurethane, etc.) each time you do a maintenance. Especially if you used linseed oil: It is better to warm the linseed oil and to apply as many layers as possible. Another less ecological but efficient option is to use varnish, polyurethane works very well and lasts quite long. Remember to sand the surface of the blade lightly with (using a rough sand paper) before applying any product. In order to facilitate the maintenance you can paint your blades with 2 different colours. Once the top paint is removed you will see the colour underneath indicating that it is time for a maintenance. Check that the balancing weights are well fixed. 6 Maintaining your wind turbine system Maintenance Manual 21 Fig. 26: Damaged plywood Fig. 27: Big washer Fibreglass blades Inspect for cracks within the resin of the surface. Fix them"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000009",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 21,
    "text": "rough sand paper) before applying any product. In order to facilitate the maintenance you can paint your blades with 2 different colours. Once the top paint is removed you will see the colour underneath indicating that it is time for a maintenance. Check that the balancing weights are well fixed. 6 Maintaining your wind turbine system Maintenance Manual 21 Fig. 26: Damaged plywood Fig. 27: Big washer Fibreglass blades Inspect for cracks within the resin of the surface. Fix them with a proper product if you see any cracks. Otherwise the water can get inside and damage the whole blade. It is also recommended to clean the blades regularly (window cleaner was found to work very well for that purpose). Plywood parts If the plywood looses one or two layers (figure 26): take out the layer and apply the same product as used for the blades. Change the plywood if it is badly damaged. An option could be using a metal piece made from stainless steel or alu- minium instead of plywood. You can use larger washers or one big “washer” (figure 27) for the 3.6m and 4.2m turbine diameter, especially in a gusty and turbulent instal- lation site. For the vane plywood, see “Frame and tail“ in section in “6.2 Alternator and Frame“. Despite the fact that wood is a very good material for the blades, it needs some care because the tip is running at around 200 km/h. Poor quality plywood does not seem to last very long on humid, sandy or salty external conditions. Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 22 von 46 Grundlagenrecherche Blade balancing Check the blade balancing while the turbine is spinning. If the tail vane is having quick left and right movements, your blade might need a new balancing. If there is no wind you can also check the balance of the blades with the tower lying on its trestle. Take special care with the screwing of the balancing weight. Use a sufficient number of screws (at least 2) and that are long enough (but should not touch the screws between plywood disk and triangle parts and the blades), otherwise the balancing weights might thrown off. Use stainless screws. If you forgot how to do the blade balancing, have a look into your construction manual. 6 Maintaining your wind turbine system Maintenance Manual 22 Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche 6.2 Alternator and frame Alternator disassembly This action should be performed if you encounter one of these 2 problems: a) Failure of the bearings or b) Friction between rotor and stator. It should also be done every 3 years. You will need the 3 jacking screws for this operation. Never put your fingers between the rotor disks, as they can be pinched! 6 Maintaining your wind turbine system Fig. 28: Alternator disassembly Fig. 29: Index threaded rod and hole Maintenance Manual 23 The overall procedure operation is to take off the front rotor, then the stator and finally the back rotor but before proces- sing find the index hole (figure 29) or the mark on the stud which indicates alignment for reassembling. If you can‘t find it, make a new one on the stud and the two rotors (before disassembling). Remember that it is very important to have this position marked. Unscrew the nuts from the front rotor. Screw the 3 jacking screws that go into the tapered hole. Screw them simultaniously to keep both rotors parallel all the time. When you have reached 10cm, the magnet field is weak enough for you to pull the rotor away. Store it in clean, dry"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000010",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 23,
    "text": "you can‘t find it, make a new one on the stud and the two rotors (before disassembling). Remember that it is very important to have this position marked. Unscrew the nuts from the front rotor. Screw the 3 jacking screws that go into the tapered hole. Screw them simultaniously to keep both rotors parallel all the time. When you have reached 10cm, the magnet field is weak enough for you to pull the rotor away. Store it in clean, dry place, away from metal components. Take away the stator. Remember the stator position (it should be the cable at the bottom). The rotors should be at equal distance all the time. Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche If you detect significant play in the hub, open everything to check and clean or change the roller bearing (see the pro - cedure next page). If the hub shaft is not welded, unscrew the nuts behind the bearing hub rotor of each stud and remove all the studs from the back rotor. Remove the back rotor carefully and put it in a safe place, far from the other rotor. Check the stator and rotor for cracks in the resin structure, for friction and for wires with missing enamel. You will need to change magnets if they are corroded (figure 32). Cut the resin and replace the corroded one with a new magnet. Refill the replaced material with new resin and repaint the whole rotor. Sometimes resin cracks occur at the edge of the rotor (figure 33). Take away the old resin that comes up and replace by a new one. Repaint the whole rotor. If any of the copper wires is without enamel, you should apply some resin or a bit of glue (like epoxy adhesive). You also need to find the cause of the problem and fix it (see Troubleshooting on page 40). Check that you have the same resistance value between the phases by using a multimeter. Check the 3-phase cable that comes out of the resin. 6 Maintaining your wind turbine system Maintenance Manual 24 Fig. 30: Front rotor with the 3 jacking screws Fig. 31: Friction on the stator Fig. 32: Damaged rotor Fig. 33: Cracks in resin in the rotor edge Fig. 34: Stator that needs to be changed Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche Replacing the roller bearings Bearings need to be replaced if the rotor rubs against the stator or when the turbine no longer turns. They should be repacked with grease every 3 years or more frequently if necessary. Usually you will require two different sets of roller bearings: 1) The basic kit (figure 34) with the two inner cones and the two roller bearings. 2) The full kit (figure 35) with the basic kit plus the rubber sealing, the nuts, the washer, the safety pin (sometimes optional) and the cap (sometimes optional). Remember: You have to change both roller bearings at the same time. We recommend to get the full kit as it‘s good to have spare parts like a safety pin and it‘s hard to get rid of the rubber sealing without damaging it. Use quality brands like SKF or SNR if possible. Make sure that your working space and your hands are clean of dust when you replace the bearings. You can keep the shaft screwed on the nacelle during the whole operation. Take out the cap by gently knocking it out with a chisel. Depending on your hub: take off the safety pin and the nuts or strike out the nuts with a suitable drift. Be careful with the nuts"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000011",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 25,
    "text": "damaging it. Use quality brands like SKF or SNR if possible. Make sure that your working space and your hands are clean of dust when you replace the bearings. You can keep the shaft screwed on the nacelle during the whole operation. Take out the cap by gently knocking it out with a chisel. Depending on your hub: take off the safety pin and the nuts or strike out the nuts with a suitable drift. Be careful with the nuts as you may encounter left hand thread or right hand thread! 6 Maintaining your wind turbine system Maintenance Manual 25 Fig. 35: Bearings full kitFig. 34: Bearings basic kit Fig. 36: Exploted view of a whole bearing Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche Take away the flange and remove the rubber seal using a screwdriver (figure 37). If you do it gently you may be able to re-use the rubber seal. Take out the outer shell by knocking it gently with a suitable drift. Keep it straight by tapping evenly on opposite sides and take care not to scratch the seating (figure 38). If you should damage the seating you can sand it with a 400 sand paper. It can be tricky to press the new bearing shell into it‘s seating. The easiest thing is to use the old shell: Cut through with an angle grinder to make it less rigid (figure 39) and use it as a drift to put the new shell home. Use a hammer large enough or a hammer plus a socket to make sure that the pressure is well divided all around the shell (figure 40). You can also use a vice to keep stable the shell while knocking. 6 Maintaining your wind turbine system Maintenance Manual 26 Fig. 37: Remove the seal Fig. 38: Take out the outer shell Fig. 40: Put the new shell home Fig. 39: Cut the shell with an angle grinder Fig. 41: Lock the nut Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche Don‘t mix up the sense of the shell! Grease the bearings thoroughly, with bearing grease but do not jam them full of grease. Start by putting the rear bearing on the shell, then assemble the rubber seal. Put it on the shaft and then fit the second bearing followed by a washer and a nut. Tighten the nut, spin the hub and then slack it off a quarter turn or so to reduce stress on the bearing. Depending on the kind of hub: - Use the safety nut and safety pin - Lock the nut by striking it on both sides with a burin (see figure 41). Add some grease in the cap and put it back gently. You can find a video animation on “how to open and change the bearing“ on the following website: http://www.tripalium.org/blog/default/post/id/330-nouvelle-video-danimation Note: some people experienced problems with freedom in the conical bearing especially with 4.2m diameter turbines. The problems occur after few years when the rotor rubs the stator. Better to use “NE“ bearing that that comes with 2 deep groove bearings. We use “Knott” vehicle bearing houses. Alternator assembly Conduct the disassembly procedure in reverse. Take lots of care while approaching the magnet rotor. Magnets must face each other. Use the index hole to find the correct position. Assemble everything and tighten well all nuts. Unscrew the jacking screws at the same time until you can pull them out freely. Apply thread lock to all stator studs and at the back of the hub. A drop of thread lock is enough. Check the gap between the rotors and the stator. The"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000012",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 27,
    "text": "disassembly procedure in reverse. Take lots of care while approaching the magnet rotor. Magnets must face each other. Use the index hole to find the correct position. Assemble everything and tighten well all nuts. Unscrew the jacking screws at the same time until you can pull them out freely. Apply thread lock to all stator studs and at the back of the hub. A drop of thread lock is enough. Check the gap between the rotors and the stator. The gap between a rotor and the stator should be around 2 or 3mm. Remember that the most important thing is the voltage at 60rpm (see table 6). You can adjust the gap by adding or removing nuts and washers. Check the voltage at 60rpm. Tab. 6: Voltage at 60 rpm Ø Turbine 1.2m 1.8m 2.4m 3m 3.6m 4.2m 12V 1.9 2.3 2.9 3.5 4.2 5.2 24V 3.4 4.2 5.3 6.5 7.7 9.4 48V 6.8 8.4 10.6 12.9 15.6 18.8 350V - - - 41.6 62.6 52.2 6 Maintaining your wind turbine system Maintenance Manual 27 Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche Electrical connection Check the waterproofness of the junction box in the holes where the cables come in and out. If it is not waterproof , change the junction box, but lower the tower before disconnecting the cables inside this junction box ! The cables should come in and out at the bottom of the junction box, that reduce risk that rain comes into it. Check the tightness of the terminal blocks and make sure that it has the correct tightness. This can save your turbine: We have already seen a wind turbine that was saved, hanging only by the terminal blocks (figure 42). 6 Maintaining your wind turbine system Maintenance Manual 28 Fig. 42: Fall avoid by tight terminal block Fig. 43: Reinforced tail Frame and tail Check the metal-frame for rust and cracks in the welds. Check all the other moving parts (tail hinge pipe) and if necessary, add some new grease. Check the condition of the washer inside the bearing and if neces- sary, replace it. If the washer is missing, add one. We recommend to have one welded washer and one loose for both tower and tail hinge pipes. Sometimes the tail and tower hinge pipe are wear down (less than 1mm thick - ness), usually because a thin diameter pipe has been used (2 or 3mm). So you will need to replace them by a thicker pipe (4 or 5mm) Check for cracks in the welding of the frame and tail vane (figure 44 displays a crack in the yaw pipe due to low end stop on a very turbulent site - the 3,6m turbine was only 2 years-old). If necessary, reinforce the structure (figure 43). Check the tightness of all the nuts on the tail vane. Fig. 44: Crack in the tail pipe Note: An unexpected low production can be due to a light tail vane. You can check the surface and thickness of the plywood wind vane and add some weight on the tail vane. If you notice wooden tail cracks at the end of the brackets, you can extend the tail boom to the middle or end of the tail plywood and change the 2 diagonal brackets by 2 vertical ones (figure 45). Fig. 45: Tail brackets Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche 6.3 Tower and foundation Tower Once the tower is down have a general look at the tower looking for rust, missing bolts, cracks in welding. Take special care at the tower yaw pipe, it‘s the one that are subject"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000013",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 28,
    "text": "end of the brackets, you can extend the tail boom to the middle or end of the tail plywood and change the 2 diagonal brackets by 2 vertical ones (figure 45). Fig. 45: Tail brackets Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche 6.3 Tower and foundation Tower Once the tower is down have a general look at the tower looking for rust, missing bolts, cracks in welding. Take special care at the tower yaw pipe, it‘s the one that are subject to the highest wear. Check all the bolts on the tower, mast base and gin pole axes, turnbuckles and shackles. Don‘t forget to add thread-lock while tightening. Check if the cable thimbles are in their correct position. Check if all cable clamps are well tightened. If they start to rust you can protect them with grease. Check if all shackles are secured (figure 46). Check if all turnbuckles are secure and if bolts are well tightened. Check the general condition of the guy wires. If you see some rust even severe rust (figure 47) you can protect the cables by soaking them in used motor oil. Use some fuel if the oil needs diluting. If there is broken cable strand, you need to change the cable. Remember that high quality galvanised, even more stainless, guy wires and fastenings last longer, even in harsh con - ditions. Check the general condition of the cables at the bottom of the tower. It is a wearing part that needs to be changed from time to time, depending on your installation site and on the cable quality. Untwist the electrical cable at the bottom of the tower. Make sure that the cable is free to twist at the bottom of the tower by removing the obstructing material (earth, sand, etc.). Check the waterproofing of the junction box, or plug state at the bottom of the tower. Check that the electrical terminals are not too oxidised. Get rid of the inhabitants of the junction box if there are any (see figure 48). 6 Maintaining your wind turbine system Fig. 48: Inhabitants in a junction box Fig. 47: Rusty guy wire Fig. 46: Secured shackle Maintenance Manual 29 Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche Foundation In case you have concrete foundations: - check for cracks in the concrete, - check the state of the rebar/chain that comes out of the concrete as it is exposed to weather and wear, - clean the base of the tower, especially if it is sandy. If you used a chain attached to heavy anchors buried under ground, dig a little bit to check the chain state. Even high quality galvanised chain rust in the ground (figure 49). Change the chain if it is rusted. If you have big pile dig into the ground, check that the pile is not moving in direction on the tower and upward. If you have to tight the guy wires often it can be a proof of a moving pile. If the pile is moving too much, you can secure it with a second one (figure 50) and check on a regular basis how the situation evolves. 6 Maintaining your wind turbine system Fig. 50: Secured anchorFig. 49: Weak chain Maintenance Manual 30 Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche 6.4 Electrical system Inspection when the turbine is running There is a risk of high voltage and high current during this testing procedure. Be careful. The following recommendation are for off-grid and grid-tied systems To identify an electrical problem, check the voltage between the phases at the bottom of the tower (1 in figure 51), at"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000014",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 30,
    "text": "situation evolves. 6 Maintaining your wind turbine system Fig. 50: Secured anchorFig. 49: Weak chain Maintenance Manual 30 Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche 6.4 Electrical system Inspection when the turbine is running There is a risk of high voltage and high current during this testing procedure. Be careful. The following recommendation are for off-grid and grid-tied systems To identify an electrical problem, check the voltage between the phases at the bottom of the tower (1 in figure 51), at the brake switch (2 in figure 51), and on the DC bus after the bridge rectifier (3 in figure 51). If the voltage between 2 phases is zero, suspect a short-circuit in the wiring or in the alternator. A pulsating torque hol- ding back the blades indicates a short between two of the 3 wires. If case of a short-circuit, an easy test is to disconnect the tower wire. If the turbine still does not start, then the short is above: in the tower cable or in the alternator. If the turbine does start, then the short is elsewhere (wiring, rectifier or controller). If no current is found, several possibilities: There may be a short-circuit failure of the alternator windings due to burned coil or insulation failures in wet conditions: In this case lower the turbine to check the stator voltage output. Electrical issues can certainly impact energy production. A blown diode in the rectifier or a bad connection in one wire will also have impact on the performance. These faults produce a growling vibration in the machine and uneven volta - ges and currents in the 3 wires. 6 Maintaining your wind turbine system Maintenance Manual 31 Fig. 51: Electrical scheme Seminarhaus ökologischer Schaugarten - Witzenhausen Grundlagenrecherche • Off-grid Explanation of figure 52: Check the AC-voltage between each phase, it should be the same between each phases (1). Check that the bridge rectifier is working properly by measuring the DC-voltage in (2). Also check the DC-voltage in different points of the circuit: Batteries (3), charge controller (4), inverter (5). It should be the same value. Check the AC-voltage output on the inverter (6). If you have a clamp meter check if there is current going into the batteries (7) and/or into the dump-load (8). If your system has a meter, check if the values are in the same range. If you see some significant difference you might need to reset your meter (see procedure in your meter manual). Check if the LEDs or the screen are working on the charge controller. Stalling can occur if the battery voltage falls to below half of its nominal value due to heavy battery discharge or because of a failure. The turbine will be loaded with current at low speed and the blades will stall, preventing the turbine from reaching operating speed. 6 Maintaining your wind turbine system Maintenance Manual 32 Fig. 52: Off-grid electrical panel Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 33 von 46 Grundlagenrecherche • Grid-tied Explanation of figure 53: Check the 3-phase voltage input from the wind turbine (1). Check the voltage and the current of the DC bus (2) going to the inverter or the dumpload (3), using the inverter screen or a clamp meter. Check that the inverter disconnection from the grid is working properly by turning off the grid (4). If the wind is strong enough, the tension will rise above the overvoltage protection limit and all the current goes to the dumpload (3). Check the daily, monthly and/or annually yield on the inverter screen. Check if the values are correct (compare annual yield to average wind"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000015",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 33,
    "text": "going to the inverter or the dumpload (3), using the inverter screen or a clamp meter. Check that the inverter disconnection from the grid is working properly by turning off the grid (4). If the wind is strong enough, the tension will rise above the overvoltage protection limit and all the current goes to the dumpload (3). Check the daily, monthly and/or annually yield on the inverter screen. Check if the values are correct (compare annual yield to average wind speed) (5). Check error messages on the inverter (5). Check that LEDs or screen are working on the charge controller. Maintenance Manual 33 Fig. x: Grid tied pannel 6 Maintaining your wind turbine system Fig. 53: Grid-tied panel Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 34 von 46 Grundlagenrecherche Inspection when the turbine is short-circuited The following recommendations are for both off-grid and grid-tied systems: At this stage you may have to lower the turbine to do further investigations. Switch ON the wind turbine (see figure 8 on page 12). Remove the dust from all electrical components (fan, heatsink, dumpload) as it can disturb a proper cooling. Check all the connections. Tighten them if necessary. Not well tightened wires can cause a fire and increase the risk of an electrical shock. Check that all ground and metal parts (charge controller, dumpload, etc.) are connected to the same ground using a multimeter on continuity. You should have a bip or OL or small ohm value (figure 54). Check the diodes assumed your multimeter is equipped with the diode testing position (figure 55): • Good diodes: - Forward diode : 0,2 to 0,8V - Reverse bias: OL • Opened (bad) diode: OL in both way • Shorted diode: 0 to 0,4V drop in both directions. If your multimeter is not equipped with the diode testing position you can use a multimeter set to the Resistance mode (Ω). The forward-biased resistance of a good diode should range from 1000Ω to 10MΩ. The reverse-biased resistance of a good diode displays OL on a multimeter. The diode is bad if values are the same in both directions. 6 Maintaining your wind turbine system Maintenance Manual 34 Fig. 54: Multimeter on continuity position Fig. 55: Diode testing Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 35 von 46 Grundlagenrecherche • Off-grid Check the battery bank voltage and the voltage of each single battery. For flood lead acid batteries: Check the level of distilled water by opening the cap. The lead plate should be flooded entirely. Add distilled water if necessary. Check the battery bank connectors. Oxidised ones should be cleaned with sand paper and be protected with some grease (figure 56). Check the fuses with your multimeter on continuity position (see figure 54). Check the surrounding area of the dumpload and look for signs of overheating or burning. Make also sure the tempe - rature in this area is neither too high nor too low. Humidity should be avoided as well. If you need to change a cable or a connector, disconnect the system from the battery bank by switching the fuse or by removing the battery connector. • Grid-tied Check the surrounding area of the dumpload and the inverter, look for signs of overheating or burning. Maintenance Manual 35 Fig. 56: Grease on connectors 6 Maintaining your wind turbine system Grundlagenrecherche7 Service frequency 7. Service frequency Maintenance Manual 36 Tab. 7: Service frequency Frequency Operations Time com- mitment Method (visual/ tool...) During the 1 st year During the 1 st month - Check the electrical installation regularly (batteries and components) - Sensitive check (visual and sound) of the"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000016",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 35,
    "text": "Grid-tied Check the surrounding area of the dumpload and the inverter, look for signs of overheating or burning. Maintenance Manual 35 Fig. 56: Grease on connectors 6 Maintaining your wind turbine system Grundlagenrecherche7 Service frequency 7. Service frequency Maintenance Manual 36 Tab. 7: Service frequency Frequency Operations Time com- mitment Method (visual/ tool...) During the 1 st year During the 1 st month - Check the electrical installation regularly (batteries and components) - Sensitive check (visual and sound) of the wind turbine - Check the cable at the bottom of the tower (open the junction box) to define the frequen- cy of untwisting the cable - Check if the brake switch is working: switch-off and check if the turbine brakes well - Check the vibration of the tower - You can detect if there is a problem with the bearings by putting your ear on the tower and listen for strange noises - Check the tension of the guy wires 30 minutes After 6 months Lower the turbine and check the tower and the turbine for: - Missing nuts, rusty components, condition of weldings, blade wear, tightness of all nuts, electrical connections, blade balancing - Remove the blades to check the alternator if necessary - Check if yaw and tail hinges are able to turn freely and add grease if needed 0,5 to 1 day After 1 year See section 5. Lowering and raising the turbine and check all parts of the turbine for wear and corrosion 1 day Monthly Check all parts while the turbine is operating: - Electrical system (battery voltage or inverter data) - Tension of the guy wires (tightness and rust of the fastenings) - Foundation, base and anchors of the tower - Visual and acoustical check on the turbine (missing nuts, abnormal spinning and/or vibration, etc.) 30 min Yearly (birthday) Lower the turbine and check everything like described in section 6: - Blades - Alternator (and bearing eventually) - Frame and tail - Tower hinge - Tower and guy wires 1 to 2 days Every 3 years - Same as “yearly service” + dismount the alternator and bearings completely - Paint metal parts and add a new blade coating 2 days After 9 years - Same as “Every 3 years” + probability to change the inverter, the batteries: Change the blades and the guy wires if necessary 3 days Grundlagenrecherche Sensory check-up (optical, acoustical) Tool check or operation with tool Multimeter check Inspection while the turbine is spinning: Check if there is any strange noise and/or vibration while the SWT is spinning. Check if the electrical system is working normally. Brake the turbine with the brake switch. For grid-tied systems: Disconnect the grid. Inspect each of the anchor points. Ensure that all equipment is secure and the guy wires are properly tensi - oned. Check to ensure that no strands are broken and the turnbuckle safety cables are in place. Check the state of the anchor point materials (concrete, chain, etc.) Install the grip hoist and the gin pole. Lower the turbine and continue with the checklist displayed on the following pages. 8 Check list 8. Check list Maintenance Manual 37 Inspection should be done with a wind speed below 7m/s. Grundlagenrecherche 8.1 Wind turbine Inspect the blades for: • Cracks noticeable in the wood or in the fiberglass (for resin blade), especially at the blade roots • Leading or trailing edge damage • Condition of the paint (if painted) or coating • Check if balancing weights are still fixed Check the rotor and stator for scratches and failures in resin Inspect the metal frame"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000017",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 37,
    "text": "8. Check list Maintenance Manual 37 Inspection should be done with a wind speed below 7m/s. Grundlagenrecherche 8.1 Wind turbine Inspect the blades for: • Cracks noticeable in the wood or in the fiberglass (for resin blade), especially at the blade roots • Leading or trailing edge damage • Condition of the paint (if painted) or coating • Check if balancing weights are still fixed Check the rotor and stator for scratches and failures in resin Inspect the metal frame for cracks and rust on the welding Inspect the condition of the electrical cable and the gripping system Check for cracks or loose equipment on the tail-boom and vane Check the tightness on the blade nuts Check the front bearing for seal integrity and grease loss. Check the thightness of the flange Check the play in the hub Check the connections in the junction box and the junction box condition Check the tail pivot system, it should move freely and have enough grease Release the turbine switching the brake OFF and check that the generator turns freely Measure the resistance between each phase 8 Check list Maintenance Manual 38 Grundlagenrecherche Maintenance Manual 39 8.2 Tower and guy wires Check if the electrical cable is twisted and check the condition of the cable. Check the tower weldings. Check the tightness of the cable clamps. Make sure that the tower shackles are secure and/or well tightened. Check the tightness of the fasteners (tower and base). Check the connection at all ground rods, at the tower and guy wires. Check the connections in the junction box and the condition of the junction box. 8.3 Electrical system Make a visual inspection for evidence of heat. Check if there are rusted parts (screws, crimp lugs, etc.). Remove the dust from all electrical components. Check the tightening of the electrical connections Check the bridge rectifier Check all the ground connections Only relevant for off-grid systems: Check the general state of the batteries and the water level, refill distilled water if necessary. Check the tightening of the electrical connections. Only relevant for grid-tied systems: Check the production on the inverter and see if the values are relevant: • Is electricity generation linked to the estimated wind conditions at the installation site? • Is the data well recorded? 8 Check list Grundlagenrecherche The following table is a non-exhaustive enumeration of damages and problems that might occur: Tab. 8: Troubleshooting Observation Diagnosis / causes Problem Remedies Blades are not spinning Hub bearing is stuck Lack of grease Add some grease inside the bearing Water ingress in hub bearing Replace the corroded parts and the bearing seal Nut too tight Loosen the nut Roller bearing out of order Change the roller bearing Ice in generator Wait for warm weather Ice on blade Wait for warmer temperatures/ make the surface blade smoother Batteries below their voltage value Charge the batteries, you may have to change them The brake switch is ON Switch the brake OFF Blades are spinning slowly in strong wind Stator and rotor are touching (scraping or rubbing sound at low rpm) Increase spacing between stator/rotor (use Loctite 243 on threads afterwards) Magnet swelling due to cor- rosion Change the affected magnet Damaged roller bearing Change the roller bearing Unscrewed or missing nuts on the stator studs Tighten them with threadlock Debris between rotor and stator Turn propeller gently by hand and blow, use piece of plastic or some tape to dislodge debris Short circuit Power cable is pinched at the top or bottom of the tower Clear the top/bottom of the tower Burnt out stator Build a new"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000018",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 40,
    "text": "on threads afterwards) Magnet swelling due to cor- rosion Change the affected magnet Damaged roller bearing Change the roller bearing Unscrewed or missing nuts on the stator studs Tighten them with threadlock Debris between rotor and stator Turn propeller gently by hand and blow, use piece of plastic or some tape to dislodge debris Short circuit Power cable is pinched at the top or bottom of the tower Clear the top/bottom of the tower Burnt out stator Build a new one Burnt out bridge rectifier Find the problem and change the rectifier The brake switch is ON Switch the brake OFF Burnt out inverter (grid con- nected) Find the problem and change the inver- ter Burnt out charge controller Find the problem and change the charge controller Burnt out stator Incorrectly calibrated furling system (tail too heavy or too long) Correct the weight problem Burnt out charge controller All the energy goes into the dumpload. That can suck out your batteries Find the problem and change the charge controller Wrong cable connection (e.g. wrong connection in power cable) Correct the connection 9. Troubleshooting 9 Troubleshooting Maintenance Manual 40 Grundlagenrecherche9 Troubleshooting Tab. 8: Troubleshooting Observation Diagnosis / causes Problem Remedies Blade runs too fast, may whistle Load disconnected Cable disconnected or wrong connection Check all the electrical connections and fuses Disconnected dumpload Re-connect the dumpload Burnt out bridge rectifier Find the problem and replace the rectifier Burnt out voltage regulator Find the problem and replace the voltage regulator No grid available and voltage under regulation value Problem will be “solved” once the voltage reaches the regulator voltage Generator problem Be sure that magnets are facing each other Reduce the gap between rotor and stator Dumpload Dumpload wrong scaled Change the dumpload Battery bank Battery bank too small Increase the capacity of the battery bank Broken blade Tail vane hit the blade Poor welding of high end and/ or low end stop Redo the welding and/or add some metal pieces to reinforce the tail vane Unbalanced blade causing excessive vibration (tail vane jumps off) Balance the blade / check the balance weight screw Losing a balancing weight Wrong number, lenght or poor quality of the screw/s used to attach the balancing weight/s Correct the default Low quality or exces- sively thin wood Use a better quality/thicker wood Tail, genera- tor and tower shake at all or some wind speeds Blade out of balance Rebalance the blades Guy wire too loose Check the guy wire tension Increase the tension, change or add turnbuckles Check for default in the an- chors Redo the anchors/ add some weight Tail vane on the ground Blade out of balance Rebalance the blades Failure of a tail wel- ding Reinforce the tail vane and rebalance the blade Excessive noi- se (whispering noise) Trailing edge too thick Re-shape the trailing edge Hole in the blade Fix it with resin or something equivalent Blades not in the same plan Correct planarity of the blades 41Maintenance Manual 41 Grundlagenrecherche Tab. 8: Troubleshooting Observation Diagnosis / causes problem remedies Excessive noise (vibrating noise) Damaged bearing Replace the roller bearing Generator roaming Happened on high voltage generator due to copper wire vibration Make sure your coils are well wound. Change the number of phases in a new stator (6 at least), use an active rectifier Blade(s) out of balance Rebalance the blade(s) Batteries not charging Dump load constantly activated Burnt out voltage regulator (possible due to lightning strike) Find the problem and change the volta- ge regulator Batteries are full, not enough consumption Invite some friends to your home Batteries reach end of"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000019",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 42,
    "text": "on high voltage generator due to copper wire vibration Make sure your coils are well wound. Change the number of phases in a new stator (6 at least), use an active rectifier Blade(s) out of balance Rebalance the blade(s) Batteries not charging Dump load constantly activated Burnt out voltage regulator (possible due to lightning strike) Find the problem and change the volta- ge regulator Batteries are full, not enough consumption Invite some friends to your home Batteries reach end of life Replace the batteries Excessive domestic power consumption Reduce your demand or add some more energy production to the system No power feed- in to the grid Electrical connection Check the phase, neutral and ground connection between inverter and grid Cable disconnected Re-connect the cable Grid disconnected Wait for the grid to come back Inverter monitoring the grid Wait for the inverter to connect to the grid/and or the wind blow stronger Generator problem See above “Blade runs too fast” Low energy production Electrical connection Blown diode Change the bridge rectifier Bad connection in one wire Redo the connection or change the wire Furling system Furls too early Add some weight on the tail vane or change the wind vane Wind resource Poor wind site Increase the tower height 9 Troubleshooting Maintenance Manual 42 Grundlagenrecherche Tab. 9 : Logbook Wind turbine initial operation date: Date Who Type of mainte- nance (frequence, corrective...) Problems / observations Work done Produc- tion (kWh) 10 Logbook 10. Logbook Maintenance Manual 43 Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 44 von 46 Grundlagenrecherche10 Logbook 10. Logbook Maintenance Manual 44 Tab. 9 : Logbook Wind turbine initial operation date: Date Who Type of mainte- nance (frequence, corrective...) Problem/observation Work done Produc- tion (kWh) GrundlagenrechercheAppendix Appendix [Crash wall] Maintenance Manual 45 Fig. 57: Blown batteries Fig. 58: Broken guy wires Fig. 59: Broken bearing Fig. 60: Broken anchor Fig. 61: Broken tail hinge Fig. 62: Burnt stator Fig. 63: Burnt Tristar batteries Fig. 64: Loss of balancing weight Fig. 65: Rusted guy wire Fig. 66: Rusted rotor Fig 67: Threaded rod too long Fig. 68: Tower too tight Seminarhaus ökologischer Schaugarten - Witzenhausen Bearbeiter_in 46 von 46 GrundlagenrechercheAppendix Appendix [Crash wall] Maintenance Manual 46 Blown batteries (figure 57): This is what happens when you use a grinder next to your battery bank while it‘s char- ging (sparks + hydrogen) Broken guy wires (figure 58): A guy wire breakes... Remedy: Use good quality guy wire or correctly sized guy wires.Chandlery correct tightness. Broken bearing (figure 59): Bearing was loose and the rubber sealing was missing: Destruction of the bearing rolls, one rotor touched the stator, damages on both rotors and stator. Remedy: Keep and/or add rubber sealing. Avoid play in the conical bearing or use NE bearing. Broken anchor (figure 60): A 22 m/s wind finished to cut a chain holding the guy wires already eroded by sand and lead to the falldown of the tower and the turbine. The pin at the tower base came off and couldn‘t avoid the tower fall - down. Everything was destroyed except rotors: blades, frame, tail, tower a bit deformed but re-used. Remedy: Change guy wires and chains if wear is observed; pour chain into concrete. Change the tower base, the sta- tor, the tail, the frame and replace the 3-phase cable. Broken tail hinge (figure 61): On a very turbulent site, the tail was always moving up and down leading to cracks on the hinge at the low stop level. Remedy: Reinforce the welding (see figure 43, page 28) if your turbine is installed on a very turbulent site. Burnt stator"
  },
  {
    "chunk_id": "Maintenance-manual-v3.2.1-web.pdf-30188f8a::chunk_000020",
    "source": "Maintenance-manual-v3.2.1-web.pdf",
    "page": 46,
    "text": "Remedy: Change guy wires and chains if wear is observed; pour chain into concrete. Change the tower base, the sta- tor, the tail, the frame and replace the 3-phase cable. Broken tail hinge (figure 61): On a very turbulent site, the tail was always moving up and down leading to cracks on the hinge at the low stop level. Remedy: Reinforce the welding (see figure 43, page 28) if your turbine is installed on a very turbulent site. Burnt stator (figure 62): Wind turbine short circuited for some time. A strong windy day leads to this failure. Remedy: In case of strong wind, let your turbine run instead of braking it. Burnt Tristar batteries (figure 63): Problem with a battery that lead the burning of the Tristar which then dumped the battery pack energy directly into the dumpload. Remedy: Check your battery bank. Make sure that your charge controller capacity (e.g. if your system gives 40A, a 45A charge controller is undersized). Loss of a balancing weight (figure 64): The turbine lost one balancing weight leading to severe blade unbalancing. The owner was away for few days during a windy period. The turbine might have shake for some days before falling off the tower. Remedy: Use a greater number of screws that are long enough for the balancing weight, at least 2 per balancing weight and good quality screws (stainless). Rusted guy wire (figure 65): After 6 months old in a sandy area of the African coast with brand new (quality) guy wires Remedy: Car oil or plant oil to protect them from corrosion. Rusted rotor (figure 66): During a preventative maintenance we have seen some cracks in the resin and a little space between the resin and the steel disc. As a consequence we could quite easily remove the block of resin from the disc. Under the resin, the disc was rusted. Remedy: Paint the rotor during every maintenance. Paint or galvanise (best solution) the steel disk before putting the mag- nets. Thread rod too long (figure 67): 28m tower; 4.2m turbine. On a very windy day, the tail vane hit the blade: blade and stator broken, frame and tail badly damaged. The thread rod was too long so the balancing weight touched the thread rod, breaking the stator and damaging the frame. A problem that could have been avoided by more precise work. Remedy: We changed the design of the tail vane for the 4.2m turbine. Make sure you are checking all details especially on big turbines. The bigger they are, the more precise you have to be. Tower too tight (figure 68): This curvy tower is the result of an excessive tension in the guy wires. Remedy: Straighten the tower and slacken the guy wires."
  }
]